trol73/avr-make/asm/include/ATxmega16E5def.inc
.equ DACA_CTRLA = 768		// Control Register A
.equ DACA_CTRLB = 769		// Control Register B
.equ DACA_CTRLC = 770		// Control Register C
.equ DACA_EVCTRL = 771		// Event Input Control
.equ DACA_TIMCTRL = 772		// Timing Control
.equ DACA_STATUS = 773		// Status
.equ DACA_CH0GAINCAL = 776		// Gain Calibration
.equ DACA_CH0OFFSETCAL = 777		// Offset Calibration
.equ DACA_CH1GAINCAL = 778		// Gain Calibration
.equ DACA_CH1OFFSETCAL = 779		// Offset Calibration
.equ DACA_CH0DATA = 792		// Channel 0 Data
.equ DACA_CH1DATA = 794		// Channel 1 Data

;*************************************************************************
;** ACA - Analog Comparator
;*************************************************************************

.equ ACA_AC0CTRL = 896		// Analog Comparator 0 Control
.equ ACA_AC1CTRL = 897		// Analog Comparator 1 Control
.equ ACA_AC0MUXCTRL = 898		// Analog Comparator 0 MUX Control
.equ ACA_AC1MUXCTRL = 899		// Analog Comparator 1 MUX Control
.equ ACA_CTRLA = 900		// Control Register A
.equ ACA_CTRLB = 901		// Control Register B
.equ ACA_WINCTRL = 902		// Window Mode Control
.equ ACA_STATUS = 903		// Status
.equ ACA_CURRCTRL = 904		// Current Source Control Register
.equ ACA_CURRCALIB = 905		// Current Source Calibration Register

;*************************************************************************
;** RTC - Real-Time Clounter
;*************************************************************************

.equ RTC_CTRL = 1024		// Control Register
.equ RTC_STATUS = 1025		// Status Register
.equ RTC_INTCTRL = 1026		// Interrupt Control Register
.equ RTC_INTFLAGS = 1027		// Interrupt Flags
.equ RTC_TEMP = 1028		// Temporary register
.equ RTC_CALIB = 1030		// Calibration Register
.equ RTC_CNT = 1032		// Count Register
.equ RTC_PER = 1034		// Period Register
.equ RTC_COMP = 1036		// Compare Register

;*************************************************************************
;** XCL - XMEGA Custom Logic
;*************************************************************************

.equ XCL_CTRLA = 1120		// Control Register A
.equ XCL_CTRLB = 1121		// Control Register B
.equ XCL_CTRLC = 1122		// Control Register C
.equ XCL_CTRLD = 1123		// Control Register D
.equ XCL_CTRLE = 1124		// Control Register E
.equ XCL_CTRLF = 1125		// Control Register F
.equ XCL_CTRLG = 1126		// Control Register G
.equ XCL_INTCTRL = 1127		// Interrupt Control Register
.equ XCL_INTFLAGS = 1128		// Interrupt Flag Register
.equ XCL_PLC = 1129		// Peripheral Lenght Control Register 
.equ XCL_CNTL = 1130		// Counter Register Low
.equ XCL_CNTH = 1131		// Counter Register High
.equ XCL_CMPL = 1132		// Compare Register Low
.equ XCL_CMPH = 1133		// Compare Register High
.equ XCL_PERCAPTL = 1134		// Period or Capture Register Low
.equ XCL_PERCAPTH = 1135		// Period or Capture Register High

;*************************************************************************
;** TWIC - Two-Wire Interface
;*************************************************************************

.equ TWIC_CTRL = 1152		// TWI Common Control Register
.equ TWIC_MASTER_CTRLA = 1153		// Control Register A
.equ TWIC_MASTER_CTRLB = 1154		// Control Register B
.equ TWIC_MASTER_CTRLC = 1155		// Control Register C
.equ TWIC_MASTER_STATUS = 1156		// Status Register
.equ TWIC_MASTER_BAUD = 1157		// Baurd Rate Control Register
.equ TWIC_MASTER_ADDR = 1158		// Address Register
.equ TWIC_MASTER_DATA = 1159		// Data Register
.equ TWIC_SLAVE_CTRLA = 1160		// Control Register A
.equ TWIC_SLAVE_CTRLB = 1161		// Control Register B
.equ TWIC_SLAVE_STATUS = 1162		// Status Register
.equ TWIC_SLAVE_ADDR = 1163		// Address Register
.equ TWIC_SLAVE_DATA = 1164		// Data Register
.equ TWIC_SLAVE_ADDRMASK = 1165		// Address Mask Register

;*************************************************************************
;** PORTA - Port Configuration
;*************************************************************************

.equ PORTA_DIR = 1536		// I/O Port Data Direction
.equ PORTA_DIRSET = 1537		// I/O Port Data Direction Set
.equ PORTA_DIRCLR = 1538		// I/O Port Data Direction Clear
.equ PORTA_DIRTGL = 1539		// I/O Port Data Direction Toggle
.equ PORTA_OUT = 1540		// I/O Port Output
.equ PORTA_OUTSET = 1541		// I/O Port Output Set
.equ PORTA_OUTCLR = 1542		// I/O Port Output Clear
.equ PORTA_OUTTGL = 1543		// I/O Port Output Toggle
.equ PORTA_IN = 1544		// I/O port Input
.equ PORTA_INTCTRL = 1545		// Interrupt Control Register
.equ PORTA_INTMASK = 1546		// Port Interrupt Mask
.equ PORTA_INTFLAGS = 1548		// Interrupt Flag Register
.equ PORTA_REMAP = 1550		// Pin Remap Register
.equ PORTA_PIN0CTRL = 1552		// Pin 0 Control Register
.equ PORTA_PIN1CTRL = 1553		// Pin 1 Control Register
.equ PORTA_PIN2CTRL = 1554		// Pin 2 Control Register
.equ PORTA_PIN3CTRL = 1555		// Pin 3 Control Register
.equ PORTA_PIN4CTRL = 1556		// Pin 4 Control Register
.equ PORTA_PIN5CTRL = 1557		// Pin 5 Control Register
.equ PORTA_PIN6CTRL = 1558		// Pin 6 Control Register
.equ PORTA_PIN7CTRL = 1559		// Pin 7 Control Register

;*************************************************************************
;** PORTC - Port Configuration
;*************************************************************************

.equ PORTC_DIR = 1600		// I/O Port Data Direction
.equ PORTC_DIRSET = 1601		// I/O Port Data Direction Set
.equ PORTC_DIRCLR = 1602		// I/O Port Data Direction Clear
.equ PORTC_DIRTGL = 1603		// I/O Port Data Direction Toggle
.equ PORTC_OUT = 1604		// I/O Port Output
.equ PORTC_OUTSET = 1605		// I/O Port Output Set
.equ PORTC_OUTCLR = 1606		// I/O Port Output Clear
.equ PORTC_OUTTGL = 1607		// I/O Port Output Toggle
.equ PORTC_IN = 1608		// I/O port Input
.equ PORTC_INTCTRL = 1609		// Interrupt Control Register
.equ PORTC_INTMASK = 1610		// Port Interrupt Mask
.equ PORTC_INTFLAGS = 1612		// Interrupt Flag Register
.equ PORTC_REMAP = 1614		// Pin Remap Register
.equ PORTC_PIN0CTRL = 1616		// Pin 0 Control Register
.equ PORTC_PIN1CTRL = 1617		// Pin 1 Control Register
.equ PORTC_PIN2CTRL = 1618		// Pin 2 Control Register
.equ PORTC_PIN3CTRL = 1619		// Pin 3 Control Register
.equ PORTC_PIN4CTRL = 1620		// Pin 4 Control Register
.equ PORTC_PIN5CTRL = 1621		// Pin 5 Control Register
.equ PORTC_PIN6CTRL = 1622		// Pin 6 Control Register
.equ PORTC_PIN7CTRL = 1623		// Pin 7 Control Register

;*************************************************************************
;** PORTD - Port Configuration
;*************************************************************************

.equ PORTD_DIR = 1632		// I/O Port Data Direction
.equ PORTD_DIRSET = 1633		// I/O Port Data Direction Set
.equ PORTD_DIRCLR = 1634		// I/O Port Data Direction Clear
.equ PORTD_DIRTGL = 1635		// I/O Port Data Direction Toggle
.equ PORTD_OUT = 1636		// I/O Port Output
.equ PORTD_OUTSET = 1637		// I/O Port Output Set
.equ PORTD_OUTCLR = 1638		// I/O Port Output Clear
.equ PORTD_OUTTGL = 1639		// I/O Port Output Toggle
.equ PORTD_IN = 1640		// I/O port Input
.equ PORTD_INTCTRL = 1641		// Interrupt Control Register
.equ PORTD_INTMASK = 1642		// Port Interrupt Mask
.equ PORTD_INTFLAGS = 1644		// Interrupt Flag Register
.equ PORTD_REMAP = 1646		// Pin Remap Register
.equ PORTD_PIN0CTRL = 1648		// Pin 0 Control Register
.equ PORTD_PIN1CTRL = 1649		// Pin 1 Control Register
.equ PORTD_PIN2CTRL = 1650		// Pin 2 Control Register
.equ PORTD_PIN3CTRL = 1651		// Pin 3 Control Register
.equ PORTD_PIN4CTRL = 1652		// Pin 4 Control Register
.equ PORTD_PIN5CTRL = 1653		// Pin 5 Control Register
.equ PORTD_PIN6CTRL = 1654		// Pin 6 Control Register
.equ PORTD_PIN7CTRL = 1655		// Pin 7 Control Register

;*************************************************************************
;** PORTR - Port Configuration
;*************************************************************************

.equ PORTR_DIR = 2016		// I/O Port Data Direction
.equ PORTR_DIRSET = 2017		// I/O Port Data Direction Set
.equ PORTR_DIRCLR = 2018		// I/O Port Data Direction Clear
.equ PORTR_DIRTGL = 2019		// I/O Port Data Direction Toggle
.equ PORTR_OUT = 2020		// I/O Port Output
.equ PORTR_OUTSET = 2021		// I/O Port Output Set
.equ PORTR_OUTCLR = 2022		// I/O Port Output Clear
.equ PORTR_OUTTGL = 2023		// I/O Port Output Toggle
.equ PORTR_IN = 2024		// I/O port Input
.equ PORTR_INTCTRL = 2025		// Interrupt Control Register
.equ PORTR_INTMASK = 2026		// Port Interrupt Mask
.equ PORTR_INTFLAGS = 2028		// Interrupt Flag Register
.equ PORTR_REMAP = 2030		// Pin Remap Register
.equ PORTR_PIN0CTRL = 2032		// Pin 0 Control Register
.equ PORTR_PIN1CTRL = 2033		// Pin 1 Control Register
.equ PORTR_PIN2CTRL = 2034		// Pin 2 Control Register
.equ PORTR_PIN3CTRL = 2035		// Pin 3 Control Register
.equ PORTR_PIN4CTRL = 2036		// Pin 4 Control Register
.equ PORTR_PIN5CTRL = 2037		// Pin 5 Control Register
.equ PORTR_PIN6CTRL = 2038		// Pin 6 Control Register
.equ PORTR_PIN7CTRL = 2039		// Pin 7 Control Register

;*************************************************************************
;** TCC4 - 16-bit Timer/Counter With PWM
;*************************************************************************

.equ TCC4_CTRLA = 2048		// Control  Register A
.equ TCC4_CTRLB = 2049		// Control Register B
.equ TCC4_CTRLC = 2050		// Control register C
.equ TCC4_CTRLD = 2051		// Control Register D
.equ TCC4_CTRLE = 2052		// Control Register E
.equ TCC4_CTRLF = 2053		// Control Register F
.equ TCC4_INTCTRLA = 2054		// Interrupt Control Register A
.equ TCC4_INTCTRLB = 2055		// Interrupt Control Register B
.equ TCC4_CTRLGCLR = 2056		// Control Register G Clear
.equ TCC4_CTRLGSET = 2057		// Control Register G Set
.equ TCC4_CTRLHCLR = 2058		// Control Register H Clear
.equ TCC4_CTRLHSET = 2059		// Control Register H Set
.equ TCC4_INTFLAGS = 2060		// Interrupt Flag Register
.equ TCC4_TEMP = 2063		// Temporary Register For 16-bit Access
.equ TCC4_CNT = 2080		// Count
.equ TCC4_PER = 2086		// Period
.equ TCC4_CCA = 2088		// Compare or Capture A
.equ TCC4_CCB = 2090		// Compare or Capture B
.equ TCC4_CCC = 2092		// Compare or Capture C
.equ TCC4_CCD = 2094		// Compare or Capture D
.equ TCC4_PERBUF = 2102		// Period Buffer
.equ TCC4_CCABUF = 2104		// Compare Or Capture A Buffer
.equ TCC4_CCBBUF = 2106		// Compare Or Capture B Buffer
.equ TCC4_CCCBUF = 2108		// Compare Or Capture C Buffer
.equ TCC4_CCDBUF = 2110		// Compare Or Capture D Buffer

;*************************************************************************
;** TCC5 - 16-bit Timer/Counter With PWM
;*************************************************************************

.equ TCC5_CTRLA = 2112		// Control  Register A
.equ TCC5_CTRLB = 2113		// Control Register B
.equ TCC5_CTRLC = 2114		// Control register C
.equ TCC5_CTRLD = 2115		// Control Register D
.equ TCC5_CTRLE = 2116		// Control Register E
.equ TCC5_CTRLF = 2117		// Control Register F
.equ TCC5_INTCTRLA = 2118		// Interrupt Control Register A
.equ TCC5_INTCTRLB = 2119		// Interrupt Control Register B
.equ TCC5_CTRLGCLR = 2120		// Control Register G Clear
.equ TCC5_CTRLGSET = 2121		// Control Register G Set
.equ TCC5_CTRLHCLR = 2122		// Control Register H Clear
.equ TCC5_CTRLHSET = 2123		// Control Register H Set
.equ TCC5_INTFLAGS = 2124		// Interrupt Flag Register
.equ TCC5_TEMP = 2127		// Temporary Register For 16-bit Access
.equ TCC5_CNT = 2144		// Count
.equ TCC5_PER = 2150		// Period
.equ TCC5_CCA = 2152		// Compare or Capture A
.equ TCC5_CCB = 2154		// Compare or Capture B
.equ TCC5_PERBUF = 2166		// Period Buffer
.equ TCC5_CCABUF = 2168		// Compare Or Capture A Buffer
.equ TCC5_CCBBUF = 2170		// Compare Or Capture B Buffer

;*************************************************************************
;** TCD5 - 16-bit Timer/Counter With PWM
;*************************************************************************

.equ TCD5_CTRLA = 2368		// Control  Register A
.equ TCD5_CTRLB = 2369		// Control Register B
.equ TCD5_CTRLC = 2370		// Control register C
.equ TCD5_CTRLD = 2371		// Control Register D
.equ TCD5_CTRLE = 2372		// Control Register E
.equ TCD5_CTRLF = 2373		// Control Register F
.equ TCD5_INTCTRLA = 2374		// Interrupt Control Register A
.equ TCD5_INTCTRLB = 2375		// Interrupt Control Register B
.equ TCD5_CTRLGCLR = 2376		// Control Register G Clear
.equ TCD5_CTRLGSET = 2377		// Control Register G Set
.equ TCD5_CTRLHCLR = 2378		// Control Register H Clear
.equ TCD5_CTRLHSET = 2379		// Control Register H Set
.equ TCD5_INTFLAGS = 2380		// Interrupt Flag Register
.equ TCD5_TEMP = 2383		// Temporary Register For 16-bit Access
.equ TCD5_CNT = 2400		// Count
.equ TCD5_PER = 2406		// Period
.equ TCD5_CCA = 2408		// Compare or Capture A
.equ TCD5_CCB = 2410		// Compare or Capture B
.equ TCD5_PERBUF = 2422		// Period Buffer
.equ TCD5_CCABUF = 2424		// Compare Or Capture A Buffer
.equ TCD5_CCBBUF = 2426		// Compare Or Capture B Buffer

;*************************************************************************
;** FAULTC4 - Fault Extension
;*************************************************************************

.equ FAULTC4_CTRLA = 2176		// Control A Register
.equ FAULTC4_CTRLB = 2177		// Control B Register
.equ FAULTC4_CTRLC = 2178		// Control C Register
.equ FAULTC4_CTRLD = 2179		// Control D Register
.equ FAULTC4_CTRLE = 2180		// Control E Register
.equ FAULTC4_STATUS = 2181		// Status Register
.equ FAULTC4_CTRLGCLR = 2182		// Control Register G Clear
.equ FAULTC4_CTRLGSET = 2183		// Control Register G set

;*************************************************************************
;** FAULTC5 - Fault Extension
;*************************************************************************

