trol73/avr-make/asm/include/ATxmega16E5def.inc
; PORTCFG_CLKOUT masks
.equ PORTCFG_CLKEVPIN_bm = 0x80 ; Clock and Event Output Pin Select bit mask
.equ PORTCFG_CLKEVPIN_bp = 7 ; Clock and Event Output Pin Select bit position
.equ PORTCFG_RTCOUT_gm = 0x60 ; RTC Clock Output Enable group mask
.equ PORTCFG_RTCOUT_gp = 5 ; RTC Clock Output Enable group position
.equ PORTCFG_RTCOUT0_bm = (1<<5) ; RTC Clock Output Enable bit 0 mask
.equ PORTCFG_RTCOUT0_bp = 5 ; RTC Clock Output Enable bit 0 position
.equ PORTCFG_RTCOUT1_bm = (1<<6) ; RTC Clock Output Enable bit 1 mask
.equ PORTCFG_RTCOUT1_bp = 6 ; RTC Clock Output Enable bit 1 position
.equ PORTCFG_CLKOUTSEL_gm = 0x0C ; Clock Output Select group mask
.equ PORTCFG_CLKOUTSEL_gp = 2 ; Clock Output Select group position
.equ PORTCFG_CLKOUTSEL0_bm = (1<<2) ; Clock Output Select bit 0 mask
.equ PORTCFG_CLKOUTSEL0_bp = 2 ; Clock Output Select bit 0 position
.equ PORTCFG_CLKOUTSEL1_bm = (1<<3) ; Clock Output Select bit 1 mask
.equ PORTCFG_CLKOUTSEL1_bp = 3 ; Clock Output Select bit 1 position
.equ PORTCFG_CLKOUT_gm = 0x03 ; Clock Output Port group mask
.equ PORTCFG_CLKOUT_gp = 0 ; Clock Output Port group position
.equ PORTCFG_CLKOUT0_bm = (1<<0) ; Clock Output Port bit 0 mask
.equ PORTCFG_CLKOUT0_bp = 0 ; Clock Output Port bit 0 position
.equ PORTCFG_CLKOUT1_bm = (1<<1) ; Clock Output Port bit 1 mask
.equ PORTCFG_CLKOUT1_bp = 1 ; Clock Output Port bit 1 position

; PORTCFG_ACEVOUT masks
.equ PORTCFG_ACOUT_gm = 0xC0 ; Analog Comparator Output Port group mask
.equ PORTCFG_ACOUT_gp = 6 ; Analog Comparator Output Port group position
.equ PORTCFG_ACOUT0_bm = (1<<6) ; Analog Comparator Output Port bit 0 mask
.equ PORTCFG_ACOUT0_bp = 6 ; Analog Comparator Output Port bit 0 position
.equ PORTCFG_ACOUT1_bm = (1<<7) ; Analog Comparator Output Port bit 1 mask
.equ PORTCFG_ACOUT1_bp = 7 ; Analog Comparator Output Port bit 1 position
.equ PORTCFG_EVOUT_gm = 0x30 ; Event Channel Output Port group mask
.equ PORTCFG_EVOUT_gp = 4 ; Event Channel Output Port group position
.equ PORTCFG_EVOUT0_bm = (1<<4) ; Event Channel Output Port bit 0 mask
.equ PORTCFG_EVOUT0_bp = 4 ; Event Channel Output Port bit 0 position
.equ PORTCFG_EVOUT1_bm = (1<<5) ; Event Channel Output Port bit 1 mask
.equ PORTCFG_EVOUT1_bp = 5 ; Event Channel Output Port bit 1 position
.equ PORTCFG_EVASYEN_bm = 0x08 ; Asynchronous Event Enabled bit mask
.equ PORTCFG_EVASYEN_bp = 3 ; Asynchronous Event Enabled bit position
.equ PORTCFG_EVOUTSEL_gm = 0x07 ; Event Channel Output Selection group mask
.equ PORTCFG_EVOUTSEL_gp = 0 ; Event Channel Output Selection group position
.equ PORTCFG_EVOUTSEL0_bm = (1<<0) ; Event Channel Output Selection bit 0 mask
.equ PORTCFG_EVOUTSEL0_bp = 0 ; Event Channel Output Selection bit 0 position
.equ PORTCFG_EVOUTSEL1_bm = (1<<1) ; Event Channel Output Selection bit 1 mask
.equ PORTCFG_EVOUTSEL1_bp = 1 ; Event Channel Output Selection bit 1 position
.equ PORTCFG_EVOUTSEL2_bm = (1<<2) ; Event Channel Output Selection bit 2 mask
.equ PORTCFG_EVOUTSEL2_bp = 2 ; Event Channel Output Selection bit 2 position

; PORTCFG_SRLCTRL  masks
.equ PORTCFG_SRLENRA_bm = 0x01 ; Slew Rate Limit Enable on PORTA bit mask
.equ PORTCFG_SRLENRA_bp = 0 ; Slew Rate Limit Enable on PORTA bit position
.equ PORTCFG_SRLENRC_bm = 0x04 ; Slew Rate Limit Enable on PORTC bit mask
.equ PORTCFG_SRLENRC_bp = 2 ; Slew Rate Limit Enable on PORTC bit position
.equ PORTCFG_SRLENRD_bm = 0x08 ; Slew Rate Limit Enable on PORTD bit mask
.equ PORTCFG_SRLENRD_bp = 3 ; Slew Rate Limit Enable on PORTD bit position
.equ PORTCFG_SRLENRR_bm = 0x80 ; Slew Rate Limit Enable on PORTR bit mask
.equ PORTCFG_SRLENRR_bp = 7 ; Slew Rate Limit Enable on PORTR bit position

; Clock and Event Output Port
.equ PORTCFG_CLKEVPIN_PIN7_gc = (0x00<<7) ; Clock and Event Ouput on PIN 7
.equ PORTCFG_CLKEVPIN_PIN4_gc = (0x01<<7) ; Clock and Event Ouput on PIN 4

; RTC Clock Output Port
.equ PORTCFG_RTCCLKOUT_OFF_gc = (0x00<<5) ; System Clock Output Disabled
.equ PORTCFG_RTCCLKOUT_PC6_gc = (0x01<<5) ; System Clock Output on Port C pin 6
.equ PORTCFG_RTCCLKOUT_PD6_gc = (0x02<<5) ; System Clock Output on Port D pin 6
.equ PORTCFG_RTCCLKOUT_PR0_gc = (0x03<<5) ; System Clock Output on Port R pin 0

; Peripheral Clock Output Select
.equ PORTCFG_CLKOUTSEL_CLK1X_gc = (0x00<<2) ; 1x Peripheral Clock Output to pin
.equ PORTCFG_CLKOUTSEL_CLK2X_gc = (0x01<<2) ; 2x Peripheral Clock Output to pin
.equ PORTCFG_CLKOUTSEL_CLK4X_gc = (0x02<<2) ; 4x Peripheral Clock Output to pin

; System Clock Output Port
.equ PORTCFG_CLKOUT_OFF_gc = (0x00<<0) ; System Clock Output Disabled
.equ PORTCFG_CLKOUT_PC7_gc = (0x01<<0) ; System Clock Output on Port C pin 7
.equ PORTCFG_CLKOUT_PD7_gc = (0x02<<0) ; System Clock Output on Port D pin 7
.equ PORTCFG_CLKOUT_PR0_gc = (0x03<<0) ; System Clock Output on Port R pin 0

; Analog Comparator Output Port
.equ PORTCFG_ACOUT_PA_gc = (0x00<<6) ; Analog Comparator Outputs on Port A, Pin 6-7
.equ PORTCFG_ACOUT_PC_gc = (0x01<<6) ; Analog Comparator Outputs on Port C, Pin 6-7
.equ PORTCFG_ACOUT_PD_gc = (0x02<<6) ; Analog Comparator Outputs on Port D, Pin 6-7
.equ PORTCFG_ACOUT_PR_gc = (0x03<<6) ; Analog Comparator Outputs on Port R, Pin 0-1

; Event Output Port
.equ PORTCFG_EVOUT_OFF_gc = (0x00<<4) ; Event Output Disabled
.equ PORTCFG_EVOUT_PC7_gc = (0x01<<4) ; Event Channel n Output on Port C pin 7
.equ PORTCFG_EVOUT_PD7_gc = (0x02<<4) ; Event Channel n Output on Port D pin 7
.equ PORTCFG_EVOUT_PR0_gc = (0x03<<4) ; Event Channel n Output on Port R pin 0

; Event Output Select
.equ PORTCFG_EVOUTSEL_0_gc = (0x00<<0) ; Event Channel 0 output to pin
.equ PORTCFG_EVOUTSEL_1_gc = (0x01<<0) ; Event Channel 1 output to pin
.equ PORTCFG_EVOUTSEL_2_gc = (0x02<<0) ; Event Channel 2 output to pin
.equ PORTCFG_EVOUTSEL_3_gc = (0x03<<0) ; Event Channel 3 output to pin
.equ PORTCFG_EVOUTSEL_4_gc = (0x04<<0) ; Event Channel 4 output to pin
.equ PORTCFG_EVOUTSEL_5_gc = (0x05<<0) ; Event Channel 5 output to pin
.equ PORTCFG_EVOUTSEL_6_gc = (0x06<<0) ; Event Channel 6 output to pin
.equ PORTCFG_EVOUTSEL_7_gc = (0x07<<0) ; Event Channel 7 output to pin


;*************************************************************************
;** CRC - Cyclic Redundancy Checker
;*************************************************************************

; CRC_CTRL masks
.equ CRC_RESET_gm = 0xC0 ; Reset group mask
.equ CRC_RESET_gp = 6 ; Reset group position
.equ CRC_RESET0_bm = (1<<6) ; Reset bit 0 mask
.equ CRC_RESET0_bp = 6 ; Reset bit 0 position
.equ CRC_RESET1_bm = (1<<7) ; Reset bit 1 mask
.equ CRC_RESET1_bp = 7 ; Reset bit 1 position
.equ CRC_CRC32_bm = 0x20 ; CRC Mode bit mask
.equ CRC_CRC32_bp = 5 ; CRC Mode bit position
.equ CRC_SOURCE_gm = 0x0F ; Input Source group mask
.equ CRC_SOURCE_gp = 0 ; Input Source group position
.equ CRC_SOURCE0_bm = (1<<0) ; Input Source bit 0 mask
.equ CRC_SOURCE0_bp = 0 ; Input Source bit 0 position
.equ CRC_SOURCE1_bm = (1<<1) ; Input Source bit 1 mask
.equ CRC_SOURCE1_bp = 1 ; Input Source bit 1 position
.equ CRC_SOURCE2_bm = (1<<2) ; Input Source bit 2 mask
.equ CRC_SOURCE2_bp = 2 ; Input Source bit 2 position
.equ CRC_SOURCE3_bm = (1<<3) ; Input Source bit 3 mask
.equ CRC_SOURCE3_bp = 3 ; Input Source bit 3 position

; CRC_STATUS masks
.equ CRC_ZERO_bm = 0x02 ; Zero detection bit mask
.equ CRC_ZERO_bp = 1 ; Zero detection bit position
.equ CRC_BUSY_bm = 0x01 ; Busy bit mask
.equ CRC_BUSY_bp = 0 ; Busy bit position

