trol73/avr-make/asm/include/ATxmega16E5def.inc
; Reset
.equ CRC_RESET_NO_gc = (0x00<<6) ; No Reset
.equ CRC_RESET_RESET0_gc = (0x02<<6) ; Reset CRC with CHECKSUM to all zeros
.equ CRC_RESET_RESET1_gc = (0x03<<6) ; Reset CRC with CHECKSUM to all ones

; Input Source
.equ CRC_SOURCE_DISABLE_gc = (0x00<<0) ; Disabled
.equ CRC_SOURCE_IO_gc = (0x01<<0) ; I/O Interface
.equ CRC_SOURCE_FLASH_gc = (0x02<<0) ; Flash
.equ CRC_SOURCE_DMAC0_gc = (0x04<<0) ; DMAC Channel 0
.equ CRC_SOURCE_DMAC1_gc = (0x05<<0) ; DMAC Channel 1
.equ CRC_SOURCE_DMAC2_gc = (0x06<<0) ; DMAC Channel 2
.equ CRC_SOURCE_DMAC3_gc = (0x07<<0) ; DMAC Channel 3


;*************************************************************************
;** EDMA - Enhanced DMA Controller
;*************************************************************************

; EDMA_CTRL masks
.equ EDMA_ENABLE_bm = 0x80 ; Enable bit mask
.equ EDMA_ENABLE_bp = 7 ; Enable bit position
.equ EDMA_RESET_bm = 0x40 ; Software Reset bit mask
.equ EDMA_RESET_bp = 6 ; Software Reset bit position
.equ EDMA_CHMODE_gm = 0x30 ; Channel Mode group mask
.equ EDMA_CHMODE_gp = 4 ; Channel Mode group position
.equ EDMA_CHMODE0_bm = (1<<4) ; Channel Mode bit 0 mask
.equ EDMA_CHMODE0_bp = 4 ; Channel Mode bit 0 position
.equ EDMA_CHMODE1_bm = (1<<5) ; Channel Mode bit 1 mask
.equ EDMA_CHMODE1_bp = 5 ; Channel Mode bit 1 position
.equ EDMA_DBUFMODE_gm = 0x0C ; Double Buffer Mode group mask
.equ EDMA_DBUFMODE_gp = 2 ; Double Buffer Mode group position
.equ EDMA_DBUFMODE0_bm = (1<<2) ; Double Buffer Mode bit 0 mask
.equ EDMA_DBUFMODE0_bp = 2 ; Double Buffer Mode bit 0 position
.equ EDMA_DBUFMODE1_bm = (1<<3) ; Double Buffer Mode bit 1 mask
.equ EDMA_DBUFMODE1_bp = 3 ; Double Buffer Mode bit 1 position
.equ EDMA_PRIMODE_gm = 0x03 ; Priority Mode group mask
.equ EDMA_PRIMODE_gp = 0 ; Priority Mode group position
.equ EDMA_PRIMODE0_bm = (1<<0) ; Priority Mode bit 0 mask
.equ EDMA_PRIMODE0_bp = 0 ; Priority Mode bit 0 position
.equ EDMA_PRIMODE1_bm = (1<<1) ; Priority Mode bit 1 mask
.equ EDMA_PRIMODE1_bp = 1 ; Priority Mode bit 1 position

; EDMA_INTFLAGS masks
.equ EDMA_CH3ERRIF_bm = 0x80 ; Channel 3 Transaction Error Interrupt Flag bit mask
.equ EDMA_CH3ERRIF_bp = 7 ; Channel 3 Transaction Error Interrupt Flag bit position
.equ EDMA_CH2ERRIF_bm = 0x40 ; Channel 2 Transaction Error Interrupt Flag bit mask
.equ EDMA_CH2ERRIF_bp = 6 ; Channel 2 Transaction Error Interrupt Flag bit position
.equ EDMA_CH1ERRIF_bm = 0x20 ; Channel 1 Transaction Error Interrupt Flag bit mask
.equ EDMA_CH1ERRIF_bp = 5 ; Channel 1 Transaction Error Interrupt Flag bit position
.equ EDMA_CH0ERRIF_bm = 0x10 ; Channel 0 Transaction Error Interrupt Flag bit mask
.equ EDMA_CH0ERRIF_bp = 4 ; Channel 0 Transaction Error Interrupt Flag bit position
.equ EDMA_CH3TRNFIF_bm = 0x08 ; Channel 3 Transaction Complete Interrupt Flag bit mask
.equ EDMA_CH3TRNFIF_bp = 3 ; Channel 3 Transaction Complete Interrupt Flag bit position
.equ EDMA_CH2TRNFIF_bm = 0x04 ; Channel 2 Transaction Complete Interrupt Flag bit mask
.equ EDMA_CH2TRNFIF_bp = 2 ; Channel 2 Transaction Complete Interrupt Flag bit position
.equ EDMA_CH1TRNFIF_bm = 0x02 ; Channel 1 Transaction Complete Interrupt Flag bit mask
.equ EDMA_CH1TRNFIF_bp = 1 ; Channel 1 Transaction Complete Interrupt Flag bit position
.equ EDMA_CH0TRNFIF_bm = 0x01 ; Channel 0 Transaction Complete Interrupt Flag bit mask
.equ EDMA_CH0TRNFIF_bp = 0 ; Channel 0 Transaction Complete Interrupt Flag bit position

; EDMA_STATUS masks
.equ EDMA_CH3BUSY_bm = 0x80 ; Channel 3 Busy Flag bit mask
.equ EDMA_CH3BUSY_bp = 7 ; Channel 3 Busy Flag bit position
.equ EDMA_CH2BUSY_bm = 0x40 ; Channel 2 Busy Flag bit mask
.equ EDMA_CH2BUSY_bp = 6 ; Channel 2 Busy Flag bit position
.equ EDMA_CH1BUSY_bm = 0x20 ; Channel 1 Busy Flag bit mask
.equ EDMA_CH1BUSY_bp = 5 ; Channel 1 Busy Flag bit position
.equ EDMA_CH0BUSY_bm = 0x10 ; Channel 0 Busy Flag bit mask
.equ EDMA_CH0BUSY_bp = 4 ; Channel 0 Busy Flag bit position
.equ EDMA_CH3PEND_bm = 0x08 ; Channel 3 Pending Flag bit mask
.equ EDMA_CH3PEND_bp = 3 ; Channel 3 Pending Flag bit position
.equ EDMA_CH2PEND_bm = 0x04 ; Channel 2 Pending Flag bit mask
.equ EDMA_CH2PEND_bp = 2 ; Channel 2 Pending Flag bit position
.equ EDMA_CH1PEND_bm = 0x02 ; Channel 1 Pending Flag bit mask
.equ EDMA_CH1PEND_bp = 1 ; Channel 1 Pending Flag bit position
.equ EDMA_CH0PEND_bm = 0x01 ; Channel 0 Pending Flag bit mask
.equ EDMA_CH0PEND_bp = 0 ; Channel 0 Pending Flag bit position

; EDMA_CH_CTRLA masks
.equ EDMA_CH_ENABLE_bm = 0x80 ; Channel Enable bit mask
.equ EDMA_CH_ENABLE_bp = 7 ; Channel Enable bit position
.equ EDMA_CH_RESET_bm = 0x40 ; Channel Software Reset bit mask
.equ EDMA_CH_RESET_bp = 6 ; Channel Software Reset bit position
.equ EDMA_CH_REPEAT_bm = 0x20 ; Channel Repeat Mode bit mask
.equ EDMA_CH_REPEAT_bp = 5 ; Channel Repeat Mode bit position
.equ EDMA_CH_TRFREQ_bm = 0x10 ; Channel Transfer Request bit mask
.equ EDMA_CH_TRFREQ_bp = 4 ; Channel Transfer Request bit position
.equ EDMA_CH_SINGLE_bm = 0x04 ; Channel Single Shot Data Transfer bit mask
.equ EDMA_CH_SINGLE_bp = 2 ; Channel Single Shot Data Transfer bit position
.equ EDMA_CH_BURSTLEN_bm = 0x01 ; Channel 2-bytes Burst Length bit mask
.equ EDMA_CH_BURSTLEN_bp = 0 ; Channel 2-bytes Burst Length bit position

; EDMA_CH_CTRLB masks
.equ EDMA_CH_CHBUSY_bm = 0x80 ; Channel Block Transfer Busy bit mask
.equ EDMA_CH_CHBUSY_bp = 7 ; Channel Block Transfer Busy bit position
.equ EDMA_CH_CHPEND_bm = 0x40 ; Channel Block Transfer Pending bit mask
.equ EDMA_CH_CHPEND_bp = 6 ; Channel Block Transfer Pending bit position
.equ EDMA_CH_ERRIF_bm = 0x20 ; Channel Transaction Error Interrupt Flag bit mask
.equ EDMA_CH_ERRIF_bp = 5 ; Channel Transaction Error Interrupt Flag bit position
.equ EDMA_CH_TRNIF_bm = 0x10 ; Channel Transaction Complete Interrup Flag bit mask
.equ EDMA_CH_TRNIF_bp = 4 ; Channel Transaction Complete Interrup Flag bit position
.equ EDMA_CH_ERRINTLVL_gm = 0x0C ; Channel Transaction Error Interrupt Level group mask
.equ EDMA_CH_ERRINTLVL_gp = 2 ; Channel Transaction Error Interrupt Level group position
.equ EDMA_CH_ERRINTLVL0_bm = (1<<2) ; Channel Transaction Error Interrupt Level bit 0 mask
.equ EDMA_CH_ERRINTLVL0_bp = 2 ; Channel Transaction Error Interrupt Level bit 0 position
.equ EDMA_CH_ERRINTLVL1_bm = (1<<3) ; Channel Transaction Error Interrupt Level bit 1 mask
.equ EDMA_CH_ERRINTLVL1_bp = 3 ; Channel Transaction Error Interrupt Level bit 1 position
.equ EDMA_CH_TRNINTLVL_gm = 0x03 ; Channel Transaction Complete Interrupt Level group mask
.equ EDMA_CH_TRNINTLVL_gp = 0 ; Channel Transaction Complete Interrupt Level group position
.equ EDMA_CH_TRNINTLVL0_bm = (1<<0) ; Channel Transaction Complete Interrupt Level bit 0 mask
.equ EDMA_CH_TRNINTLVL0_bp = 0 ; Channel Transaction Complete Interrupt Level bit 0 position
.equ EDMA_CH_TRNINTLVL1_bm = (1<<1) ; Channel Transaction Complete Interrupt Level bit 1 mask
.equ EDMA_CH_TRNINTLVL1_bp = 1 ; Channel Transaction Complete Interrupt Level bit 1 position

; EDMA_CH_ADDRCTRL masks
.equ EDMA_CH_RELOAD_gm = 0x30 ; Memory Address Reload for Peripheral Ch., or Source Address Reload for Standard Ch. group mask
.equ EDMA_CH_RELOAD_gp = 4 ; Memory Address Reload for Peripheral Ch., or Source Address Reload for Standard Ch. group position
.equ EDMA_CH_RELOAD0_bm = (1<<4) ; Memory Address Reload for Peripheral Ch., or Source Address Reload for Standard Ch. bit 0 mask
.equ EDMA_CH_RELOAD0_bp = 4 ; Memory Address Reload for Peripheral Ch., or Source Address Reload for Standard Ch. bit 0 position
.equ EDMA_CH_RELOAD1_bm = (1<<5) ; Memory Address Reload for Peripheral Ch., or Source Address Reload for Standard Ch. bit 1 mask
.equ EDMA_CH_RELOAD1_bp = 5 ; Memory Address Reload for Peripheral Ch., or Source Address Reload for Standard Ch. bit 1 position
.equ EDMA_CH_DIR_gm = 0x07 ; Memory Address Mode for Peripheral Ch., or Source Address Mode for Standard Ch. group mask
.equ EDMA_CH_DIR_gp = 0 ; Memory Address Mode for Peripheral Ch., or Source Address Mode for Standard Ch. group position
.equ EDMA_CH_DIR0_bm = (1<<0) ; Memory Address Mode for Peripheral Ch., or Source Address Mode for Standard Ch. bit 0 mask
.equ EDMA_CH_DIR0_bp = 0 ; Memory Address Mode for Peripheral Ch., or Source Address Mode for Standard Ch. bit 0 position
.equ EDMA_CH_DIR1_bm = (1<<1) ; Memory Address Mode for Peripheral Ch., or Source Address Mode for Standard Ch. bit 1 mask
.equ EDMA_CH_DIR1_bp = 1 ; Memory Address Mode for Peripheral Ch., or Source Address Mode for Standard Ch. bit 1 position
.equ EDMA_CH_DIR2_bm = (1<<2) ; Memory Address Mode for Peripheral Ch., or Source Address Mode for Standard Ch. bit 2 mask
.equ EDMA_CH_DIR2_bp = 2 ; Memory Address Mode for Peripheral Ch., or Source Address Mode for Standard Ch. bit 2 position

; EDMA_CH_DESTADDRCTRL masks
.equ EDMA_CH_DESTRELOAD_gm = 0x30 ; Destination Address Reload for Standard Channels Only. group mask
.equ EDMA_CH_DESTRELOAD_gp = 4 ; Destination Address Reload for Standard Channels Only. group position
.equ EDMA_CH_DESTRELOAD0_bm = (1<<4) ; Destination Address Reload for Standard Channels Only. bit 0 mask
.equ EDMA_CH_DESTRELOAD0_bp = 4 ; Destination Address Reload for Standard Channels Only. bit 0 position
.equ EDMA_CH_DESTRELOAD1_bm = (1<<5) ; Destination Address Reload for Standard Channels Only. bit 1 mask
.equ EDMA_CH_DESTRELOAD1_bp = 5 ; Destination Address Reload for Standard Channels Only. bit 1 position
.equ EDMA_CH_DESTDIR_gm = 0x07 ; Destination Address Mode for Standard Channels Only. group mask
.equ EDMA_CH_DESTDIR_gp = 0 ; Destination Address Mode for Standard Channels Only. group position
.equ EDMA_CH_DESTDIR0_bm = (1<<0) ; Destination Address Mode for Standard Channels Only. bit 0 mask
.equ EDMA_CH_DESTDIR0_bp = 0 ; Destination Address Mode for Standard Channels Only. bit 0 position
.equ EDMA_CH_DESTDIR1_bm = (1<<1) ; Destination Address Mode for Standard Channels Only. bit 1 mask
.equ EDMA_CH_DESTDIR1_bp = 1 ; Destination Address Mode for Standard Channels Only. bit 1 position
.equ EDMA_CH_DESTDIR2_bm = (1<<2) ; Destination Address Mode for Standard Channels Only. bit 2 mask
.equ EDMA_CH_DESTDIR2_bp = 2 ; Destination Address Mode for Standard Channels Only. bit 2 position

