trol73/avr-make/asm/include/ATxmega16E5def.inc
; XCL_INTFLAGS masks
.equ XCL_UNF1IF_bm = 0x80 ; Timer/Counter 1 Underflow Interrupt Flag bit mask
.equ XCL_UNF1IF_bp = 7 ; Timer/Counter 1 Underflow Interrupt Flag bit position
.equ XCL_PEC1IF_bm = 0x80 ; Peripheral Counter 1 Interrupt Flag bit mask
.equ XCL_PEC1IF_bp = 7 ; Peripheral Counter 1 Interrupt Flag bit position
.equ XCL_PEC21IF_bm = 0x80 ; Peripheral High Counter 2 Interrupt Flag bit mask
.equ XCL_PEC21IF_bp = 7 ; Peripheral High Counter 2 Interrupt Flag bit position
.equ XCL_UNF0IF_bm = 0x40 ; Timer/Counter 0 Underflow Interrupt Flag bit mask
.equ XCL_UNF0IF_bp = 6 ; Timer/Counter 0 Underflow Interrupt Flag bit position
.equ XCL_PEC0IF_bm = 0x40 ; Peripheral Counter 0 Interrupt Flag bit mask
.equ XCL_PEC0IF_bp = 6 ; Peripheral Counter 0 Interrupt Flag bit position
.equ XCL_CC1IF_bm = 0x20 ; Compare or Capture Channel 1 Interrupt Flag bit mask
.equ XCL_CC1IF_bp = 5 ; Compare or Capture Channel 1 Interrupt Flag bit position
.equ XCL_PEC20IF_bm = 0x20 ; Peripheral Low Counter 2 Interrupt Flag bit mask
.equ XCL_PEC20IF_bp = 5 ; Peripheral Low Counter 2 Interrupt Flag bit position
.equ XCL_CC0IF_bm = 0x10 ; Compare or Capture Channel 0 Interrupt Flag bit mask
.equ XCL_CC0IF_bp = 4 ; Compare or Capture Channel 0 Interrupt Flag bit position

; XCL_PLC masks
.equ XCL_PLC_gm = 0xFF ; Peripheral Lenght Control Bits group mask
.equ XCL_PLC_gp = 0 ; Peripheral Lenght Control Bits group position
.equ XCL_PLC0_bm = (1<<0) ; Peripheral Lenght Control Bits bit 0 mask
.equ XCL_PLC0_bp = 0 ; Peripheral Lenght Control Bits bit 0 position
.equ XCL_PLC1_bm = (1<<1) ; Peripheral Lenght Control Bits bit 1 mask
.equ XCL_PLC1_bp = 1 ; Peripheral Lenght Control Bits bit 1 position
.equ XCL_PLC2_bm = (1<<2) ; Peripheral Lenght Control Bits bit 2 mask
.equ XCL_PLC2_bp = 2 ; Peripheral Lenght Control Bits bit 2 position
.equ XCL_PLC3_bm = (1<<3) ; Peripheral Lenght Control Bits bit 3 mask
.equ XCL_PLC3_bp = 3 ; Peripheral Lenght Control Bits bit 3 position
.equ XCL_PLC4_bm = (1<<4) ; Peripheral Lenght Control Bits bit 4 mask
.equ XCL_PLC4_bp = 4 ; Peripheral Lenght Control Bits bit 4 position
.equ XCL_PLC5_bm = (1<<5) ; Peripheral Lenght Control Bits bit 5 mask
.equ XCL_PLC5_bp = 5 ; Peripheral Lenght Control Bits bit 5 position
.equ XCL_PLC6_bm = (1<<6) ; Peripheral Lenght Control Bits bit 6 mask
.equ XCL_PLC6_bp = 6 ; Peripheral Lenght Control Bits bit 6 position
.equ XCL_PLC7_bm = (1<<7) ; Peripheral Lenght Control Bits bit 7 mask
.equ XCL_PLC7_bp = 7 ; Peripheral Lenght Control Bits bit 7 position

; XCL_CNTL masks
.equ XCL_BCNTO_gm = 0xFF ; BTC0 Counter Byte group mask
.equ XCL_BCNTO_gp = 0 ; BTC0 Counter Byte group position
.equ XCL_BCNTO0_bm = (1<<0) ; BTC0 Counter Byte bit 0 mask
.equ XCL_BCNTO0_bp = 0 ; BTC0 Counter Byte bit 0 position
.equ XCL_BCNTO1_bm = (1<<1) ; BTC0 Counter Byte bit 1 mask
.equ XCL_BCNTO1_bp = 1 ; BTC0 Counter Byte bit 1 position
.equ XCL_BCNTO2_bm = (1<<2) ; BTC0 Counter Byte bit 2 mask
.equ XCL_BCNTO2_bp = 2 ; BTC0 Counter Byte bit 2 position
.equ XCL_BCNTO3_bm = (1<<3) ; BTC0 Counter Byte bit 3 mask
.equ XCL_BCNTO3_bp = 3 ; BTC0 Counter Byte bit 3 position
.equ XCL_BCNTO4_bm = (1<<4) ; BTC0 Counter Byte bit 4 mask
.equ XCL_BCNTO4_bp = 4 ; BTC0 Counter Byte bit 4 position
.equ XCL_BCNTO5_bm = (1<<5) ; BTC0 Counter Byte bit 5 mask
.equ XCL_BCNTO5_bp = 5 ; BTC0 Counter Byte bit 5 position
.equ XCL_BCNTO6_bm = (1<<6) ; BTC0 Counter Byte bit 6 mask
.equ XCL_BCNTO6_bp = 6 ; BTC0 Counter Byte bit 6 position
.equ XCL_BCNTO7_bm = (1<<7) ; BTC0 Counter Byte bit 7 mask
.equ XCL_BCNTO7_bp = 7 ; BTC0 Counter Byte bit 7 position
.equ XCL_CNTL_gm = 0xFF ; TC16 Counter Low Byte group mask
.equ XCL_CNTL_gp = 0 ; TC16 Counter Low Byte group position
.equ XCL_CNTL0_bm = (1<<0) ; TC16 Counter Low Byte bit 0 mask
.equ XCL_CNTL0_bp = 0 ; TC16 Counter Low Byte bit 0 position
.equ XCL_CNTL1_bm = (1<<1) ; TC16 Counter Low Byte bit 1 mask
.equ XCL_CNTL1_bp = 1 ; TC16 Counter Low Byte bit 1 position
.equ XCL_CNTL2_bm = (1<<2) ; TC16 Counter Low Byte bit 2 mask
.equ XCL_CNTL2_bp = 2 ; TC16 Counter Low Byte bit 2 position
.equ XCL_CNTL3_bm = (1<<3) ; TC16 Counter Low Byte bit 3 mask
.equ XCL_CNTL3_bp = 3 ; TC16 Counter Low Byte bit 3 position
.equ XCL_CNTL4_bm = (1<<4) ; TC16 Counter Low Byte bit 4 mask
.equ XCL_CNTL4_bp = 4 ; TC16 Counter Low Byte bit 4 position
.equ XCL_CNTL5_bm = (1<<5) ; TC16 Counter Low Byte bit 5 mask
.equ XCL_CNTL5_bp = 5 ; TC16 Counter Low Byte bit 5 position
.equ XCL_CNTL6_bm = (1<<6) ; TC16 Counter Low Byte bit 6 mask
.equ XCL_CNTL6_bp = 6 ; TC16 Counter Low Byte bit 6 position
.equ XCL_CNTL7_bm = (1<<7) ; TC16 Counter Low Byte bit 7 mask
.equ XCL_CNTL7_bp = 7 ; TC16 Counter Low Byte bit 7 position
.equ XCL_PCNTO_gm = 0xFF ; Peripheral Counter 0 Byte group mask
.equ XCL_PCNTO_gp = 0 ; Peripheral Counter 0 Byte group position
.equ XCL_PCNTO0_bm = (1<<0) ; Peripheral Counter 0 Byte bit 0 mask
.equ XCL_PCNTO0_bp = 0 ; Peripheral Counter 0 Byte bit 0 position
.equ XCL_PCNTO1_bm = (1<<1) ; Peripheral Counter 0 Byte bit 1 mask
.equ XCL_PCNTO1_bp = 1 ; Peripheral Counter 0 Byte bit 1 position
.equ XCL_PCNTO2_bm = (1<<2) ; Peripheral Counter 0 Byte bit 2 mask
.equ XCL_PCNTO2_bp = 2 ; Peripheral Counter 0 Byte bit 2 position
.equ XCL_PCNTO3_bm = (1<<3) ; Peripheral Counter 0 Byte bit 3 mask
.equ XCL_PCNTO3_bp = 3 ; Peripheral Counter 0 Byte bit 3 position
.equ XCL_PCNTO4_bm = (1<<4) ; Peripheral Counter 0 Byte bit 4 mask
.equ XCL_PCNTO4_bp = 4 ; Peripheral Counter 0 Byte bit 4 position
.equ XCL_PCNTO5_bm = (1<<5) ; Peripheral Counter 0 Byte bit 5 mask
.equ XCL_PCNTO5_bp = 5 ; Peripheral Counter 0 Byte bit 5 position
.equ XCL_PCNTO6_bm = (1<<6) ; Peripheral Counter 0 Byte bit 6 mask
.equ XCL_PCNTO6_bp = 6 ; Peripheral Counter 0 Byte bit 6 position
.equ XCL_PCNTO7_bm = (1<<7) ; Peripheral Counter 0 Byte bit 7 mask
.equ XCL_PCNTO7_bp = 7 ; Peripheral Counter 0 Byte bit 7 position

; XCL_CNTH masks
.equ XCL_BCNT1_gm = 0xFF ; BTC1 Counter Byte group mask
.equ XCL_BCNT1_gp = 0 ; BTC1 Counter Byte group position
.equ XCL_BCNT10_bm = (1<<0) ; BTC1 Counter Byte bit 0 mask
.equ XCL_BCNT10_bp = 0 ; BTC1 Counter Byte bit 0 position
.equ XCL_BCNT11_bm = (1<<1) ; BTC1 Counter Byte bit 1 mask
.equ XCL_BCNT11_bp = 1 ; BTC1 Counter Byte bit 1 position
.equ XCL_BCNT12_bm = (1<<2) ; BTC1 Counter Byte bit 2 mask
.equ XCL_BCNT12_bp = 2 ; BTC1 Counter Byte bit 2 position
.equ XCL_BCNT13_bm = (1<<3) ; BTC1 Counter Byte bit 3 mask
.equ XCL_BCNT13_bp = 3 ; BTC1 Counter Byte bit 3 position
.equ XCL_BCNT14_bm = (1<<4) ; BTC1 Counter Byte bit 4 mask
.equ XCL_BCNT14_bp = 4 ; BTC1 Counter Byte bit 4 position
.equ XCL_BCNT15_bm = (1<<5) ; BTC1 Counter Byte bit 5 mask
.equ XCL_BCNT15_bp = 5 ; BTC1 Counter Byte bit 5 position
.equ XCL_BCNT16_bm = (1<<6) ; BTC1 Counter Byte bit 6 mask
.equ XCL_BCNT16_bp = 6 ; BTC1 Counter Byte bit 6 position
.equ XCL_BCNT17_bm = (1<<7) ; BTC1 Counter Byte bit 7 mask
.equ XCL_BCNT17_bp = 7 ; BTC1 Counter Byte bit 7 position
.equ XCL_CNTH_gm = 0xFF ; TC16 Counter High Byte group mask
.equ XCL_CNTH_gp = 0 ; TC16 Counter High Byte group position
.equ XCL_CNTH0_bm = (1<<0) ; TC16 Counter High Byte bit 0 mask
.equ XCL_CNTH0_bp = 0 ; TC16 Counter High Byte bit 0 position
.equ XCL_CNTH1_bm = (1<<1) ; TC16 Counter High Byte bit 1 mask
.equ XCL_CNTH1_bp = 1 ; TC16 Counter High Byte bit 1 position
.equ XCL_CNTH2_bm = (1<<2) ; TC16 Counter High Byte bit 2 mask
.equ XCL_CNTH2_bp = 2 ; TC16 Counter High Byte bit 2 position
.equ XCL_CNTH3_bm = (1<<3) ; TC16 Counter High Byte bit 3 mask
.equ XCL_CNTH3_bp = 3 ; TC16 Counter High Byte bit 3 position
.equ XCL_CNTH4_bm = (1<<4) ; TC16 Counter High Byte bit 4 mask
.equ XCL_CNTH4_bp = 4 ; TC16 Counter High Byte bit 4 position
.equ XCL_CNTH5_bm = (1<<5) ; TC16 Counter High Byte bit 5 mask
.equ XCL_CNTH5_bp = 5 ; TC16 Counter High Byte bit 5 position
.equ XCL_CNTH6_bm = (1<<6) ; TC16 Counter High Byte bit 6 mask
.equ XCL_CNTH6_bp = 6 ; TC16 Counter High Byte bit 6 position
.equ XCL_CNTH7_bm = (1<<7) ; TC16 Counter High Byte bit 7 mask
.equ XCL_CNTH7_bp = 7 ; TC16 Counter High Byte bit 7 position
.equ XCL_PCNT1_gm = 0xFF ; Peripheral Counter 1 Byte group mask
.equ XCL_PCNT1_gp = 0 ; Peripheral Counter 1 Byte group position
.equ XCL_PCNT10_bm = (1<<0) ; Peripheral Counter 1 Byte bit 0 mask
.equ XCL_PCNT10_bp = 0 ; Peripheral Counter 1 Byte bit 0 position
.equ XCL_PCNT11_bm = (1<<1) ; Peripheral Counter 1 Byte bit 1 mask
.equ XCL_PCNT11_bp = 1 ; Peripheral Counter 1 Byte bit 1 position
.equ XCL_PCNT12_bm = (1<<2) ; Peripheral Counter 1 Byte bit 2 mask
.equ XCL_PCNT12_bp = 2 ; Peripheral Counter 1 Byte bit 2 position
.equ XCL_PCNT13_bm = (1<<3) ; Peripheral Counter 1 Byte bit 3 mask
.equ XCL_PCNT13_bp = 3 ; Peripheral Counter 1 Byte bit 3 position
.equ XCL_PCNT14_bm = (1<<4) ; Peripheral Counter 1 Byte bit 4 mask
.equ XCL_PCNT14_bp = 4 ; Peripheral Counter 1 Byte bit 4 position
.equ XCL_PCNT15_bm = (1<<5) ; Peripheral Counter 1 Byte bit 5 mask
.equ XCL_PCNT15_bp = 5 ; Peripheral Counter 1 Byte bit 5 position
.equ XCL_PCNT16_bm = (1<<6) ; Peripheral Counter 1 Byte bit 6 mask
.equ XCL_PCNT16_bp = 6 ; Peripheral Counter 1 Byte bit 6 position
.equ XCL_PCNT17_bm = (1<<7) ; Peripheral Counter 1 Byte bit 7 mask
.equ XCL_PCNT17_bp = 7 ; Peripheral Counter 1 Byte bit 7 position
.equ XCL_PCNT21_gm = 0xF0 ; Peripheral High Counter 2 Bits group mask
.equ XCL_PCNT21_gp = 4 ; Peripheral High Counter 2 Bits group position
.equ XCL_PCNT210_bm = (1<<4) ; Peripheral High Counter 2 Bits bit 0 mask
.equ XCL_PCNT210_bp = 4 ; Peripheral High Counter 2 Bits bit 0 position
.equ XCL_PCNT211_bm = (1<<5) ; Peripheral High Counter 2 Bits bit 1 mask
.equ XCL_PCNT211_bp = 5 ; Peripheral High Counter 2 Bits bit 1 position
.equ XCL_PCNT212_bm = (1<<6) ; Peripheral High Counter 2 Bits bit 2 mask
.equ XCL_PCNT212_bp = 6 ; Peripheral High Counter 2 Bits bit 2 position
.equ XCL_PCNT213_bm = (1<<7) ; Peripheral High Counter 2 Bits bit 3 mask
.equ XCL_PCNT213_bp = 7 ; Peripheral High Counter 2 Bits bit 3 position
.equ XCL_PCNT20_gm = 0x0F ; Peripheral Low Counter 2 Bits group mask
.equ XCL_PCNT20_gp = 0 ; Peripheral Low Counter 2 Bits group position
.equ XCL_PCNT200_bm = (1<<0) ; Peripheral Low Counter 2 Bits bit 0 mask
.equ XCL_PCNT200_bp = 0 ; Peripheral Low Counter 2 Bits bit 0 position
.equ XCL_PCNT201_bm = (1<<1) ; Peripheral Low Counter 2 Bits bit 1 mask
.equ XCL_PCNT201_bp = 1 ; Peripheral Low Counter 2 Bits bit 1 position
.equ XCL_PCNT202_bm = (1<<2) ; Peripheral Low Counter 2 Bits bit 2 mask
.equ XCL_PCNT202_bp = 2 ; Peripheral Low Counter 2 Bits bit 2 position
.equ XCL_PCNT203_bm = (1<<3) ; Peripheral Low Counter 2 Bits bit 3 mask
.equ XCL_PCNT203_bp = 3 ; Peripheral Low Counter 2 Bits bit 3 position

; XCL_CMPL masks
.equ XCL_CMPL_gm = 0xFF ; TC16 Compare Low Byte group mask
.equ XCL_CMPL_gp = 0 ; TC16 Compare Low Byte group position
.equ XCL_CMPL0_bm = (1<<0) ; TC16 Compare Low Byte bit 0 mask
.equ XCL_CMPL0_bp = 0 ; TC16 Compare Low Byte bit 0 position
.equ XCL_CMPL1_bm = (1<<1) ; TC16 Compare Low Byte bit 1 mask
.equ XCL_CMPL1_bp = 1 ; TC16 Compare Low Byte bit 1 position
.equ XCL_CMPL2_bm = (1<<2) ; TC16 Compare Low Byte bit 2 mask
.equ XCL_CMPL2_bp = 2 ; TC16 Compare Low Byte bit 2 position
.equ XCL_CMPL3_bm = (1<<3) ; TC16 Compare Low Byte bit 3 mask
.equ XCL_CMPL3_bp = 3 ; TC16 Compare Low Byte bit 3 position
.equ XCL_CMPL4_bm = (1<<4) ; TC16 Compare Low Byte bit 4 mask
.equ XCL_CMPL4_bp = 4 ; TC16 Compare Low Byte bit 4 position
.equ XCL_CMPL5_bm = (1<<5) ; TC16 Compare Low Byte bit 5 mask
.equ XCL_CMPL5_bp = 5 ; TC16 Compare Low Byte bit 5 position
.equ XCL_CMPL6_bm = (1<<6) ; TC16 Compare Low Byte bit 6 mask
.equ XCL_CMPL6_bp = 6 ; TC16 Compare Low Byte bit 6 position
.equ XCL_CMPL7_bm = (1<<7) ; TC16 Compare Low Byte bit 7 mask
.equ XCL_CMPL7_bp = 7 ; TC16 Compare Low Byte bit 7 position
.equ XCL_BCMP0_gm = 0xFF ; BTC0 Compare Byte group mask
.equ XCL_BCMP0_gp = 0 ; BTC0 Compare Byte group position
.equ XCL_BCMP00_bm = (1<<0) ; BTC0 Compare Byte bit 0 mask
.equ XCL_BCMP00_bp = 0 ; BTC0 Compare Byte bit 0 position
.equ XCL_BCMP01_bm = (1<<1) ; BTC0 Compare Byte bit 1 mask
.equ XCL_BCMP01_bp = 1 ; BTC0 Compare Byte bit 1 position
.equ XCL_BCMP02_bm = (1<<2) ; BTC0 Compare Byte bit 2 mask
.equ XCL_BCMP02_bp = 2 ; BTC0 Compare Byte bit 2 position
.equ XCL_BCMP03_bm = (1<<3) ; BTC0 Compare Byte bit 3 mask
.equ XCL_BCMP03_bp = 3 ; BTC0 Compare Byte bit 3 position
.equ XCL_BCMP04_bm = (1<<4) ; BTC0 Compare Byte bit 4 mask
.equ XCL_BCMP04_bp = 4 ; BTC0 Compare Byte bit 4 position
.equ XCL_BCMP05_bm = (1<<5) ; BTC0 Compare Byte bit 5 mask
.equ XCL_BCMP05_bp = 5 ; BTC0 Compare Byte bit 5 position
.equ XCL_BCMP06_bm = (1<<6) ; BTC0 Compare Byte bit 6 mask
.equ XCL_BCMP06_bp = 6 ; BTC0 Compare Byte bit 6 position
.equ XCL_BCMP07_bm = (1<<7) ; BTC0 Compare Byte bit 7 mask
.equ XCL_BCMP07_bp = 7 ; BTC0 Compare Byte bit 7 position

