trol73/avr-make/asm/include/ATxmega16E5def.inc
; XCL_CMPH masks
.equ XCL_CMPH_gm = 0xFF ; TC16 Compare High Byte group mask
.equ XCL_CMPH_gp = 0 ; TC16 Compare High Byte group position
.equ XCL_CMPH0_bm = (1<<0) ; TC16 Compare High Byte bit 0 mask
.equ XCL_CMPH0_bp = 0 ; TC16 Compare High Byte bit 0 position
.equ XCL_CMPH1_bm = (1<<1) ; TC16 Compare High Byte bit 1 mask
.equ XCL_CMPH1_bp = 1 ; TC16 Compare High Byte bit 1 position
.equ XCL_CMPH2_bm = (1<<2) ; TC16 Compare High Byte bit 2 mask
.equ XCL_CMPH2_bp = 2 ; TC16 Compare High Byte bit 2 position
.equ XCL_CMPH3_bm = (1<<3) ; TC16 Compare High Byte bit 3 mask
.equ XCL_CMPH3_bp = 3 ; TC16 Compare High Byte bit 3 position
.equ XCL_CMPH4_bm = (1<<4) ; TC16 Compare High Byte bit 4 mask
.equ XCL_CMPH4_bp = 4 ; TC16 Compare High Byte bit 4 position
.equ XCL_CMPH5_bm = (1<<5) ; TC16 Compare High Byte bit 5 mask
.equ XCL_CMPH5_bp = 5 ; TC16 Compare High Byte bit 5 position
.equ XCL_CMPH6_bm = (1<<6) ; TC16 Compare High Byte bit 6 mask
.equ XCL_CMPH6_bp = 6 ; TC16 Compare High Byte bit 6 position
.equ XCL_CMPH7_bm = (1<<7) ; TC16 Compare High Byte bit 7 mask
.equ XCL_CMPH7_bp = 7 ; TC16 Compare High Byte bit 7 position
.equ XCL_BCMP1_gm = 0xFF ; BTC1 Compare Byte group mask
.equ XCL_BCMP1_gp = 0 ; BTC1 Compare Byte group position
.equ XCL_BCMP10_bm = (1<<0) ; BTC1 Compare Byte bit 0 mask
.equ XCL_BCMP10_bp = 0 ; BTC1 Compare Byte bit 0 position
.equ XCL_BCMP11_bm = (1<<1) ; BTC1 Compare Byte bit 1 mask
.equ XCL_BCMP11_bp = 1 ; BTC1 Compare Byte bit 1 position
.equ XCL_BCMP12_bm = (1<<2) ; BTC1 Compare Byte bit 2 mask
.equ XCL_BCMP12_bp = 2 ; BTC1 Compare Byte bit 2 position
.equ XCL_BCMP13_bm = (1<<3) ; BTC1 Compare Byte bit 3 mask
.equ XCL_BCMP13_bp = 3 ; BTC1 Compare Byte bit 3 position
.equ XCL_BCMP14_bm = (1<<4) ; BTC1 Compare Byte bit 4 mask
.equ XCL_BCMP14_bp = 4 ; BTC1 Compare Byte bit 4 position
.equ XCL_BCMP15_bm = (1<<5) ; BTC1 Compare Byte bit 5 mask
.equ XCL_BCMP15_bp = 5 ; BTC1 Compare Byte bit 5 position
.equ XCL_BCMP16_bm = (1<<6) ; BTC1 Compare Byte bit 6 mask
.equ XCL_BCMP16_bp = 6 ; BTC1 Compare Byte bit 6 position
.equ XCL_BCMP17_bm = (1<<7) ; BTC1 Compare Byte bit 7 mask
.equ XCL_BCMP17_bp = 7 ; BTC1 Compare Byte bit 7 position

; XCL_PERCAPTL masks
.equ XCL_PERL_gm = 0xFF ; TC16 Low Byte Period group mask
.equ XCL_PERL_gp = 0 ; TC16 Low Byte Period group position
.equ XCL_PERL0_bm = (1<<0) ; TC16 Low Byte Period bit 0 mask
.equ XCL_PERL0_bp = 0 ; TC16 Low Byte Period bit 0 position
.equ XCL_PERL1_bm = (1<<1) ; TC16 Low Byte Period bit 1 mask
.equ XCL_PERL1_bp = 1 ; TC16 Low Byte Period bit 1 position
.equ XCL_PERL2_bm = (1<<2) ; TC16 Low Byte Period bit 2 mask
.equ XCL_PERL2_bp = 2 ; TC16 Low Byte Period bit 2 position
.equ XCL_PERL3_bm = (1<<3) ; TC16 Low Byte Period bit 3 mask
.equ XCL_PERL3_bp = 3 ; TC16 Low Byte Period bit 3 position
.equ XCL_PERL4_bm = (1<<4) ; TC16 Low Byte Period bit 4 mask
.equ XCL_PERL4_bp = 4 ; TC16 Low Byte Period bit 4 position
.equ XCL_PERL5_bm = (1<<5) ; TC16 Low Byte Period bit 5 mask
.equ XCL_PERL5_bp = 5 ; TC16 Low Byte Period bit 5 position
.equ XCL_PERL6_bm = (1<<6) ; TC16 Low Byte Period bit 6 mask
.equ XCL_PERL6_bp = 6 ; TC16 Low Byte Period bit 6 position
.equ XCL_PERL7_bm = (1<<7) ; TC16 Low Byte Period bit 7 mask
.equ XCL_PERL7_bp = 7 ; TC16 Low Byte Period bit 7 position
.equ XCL_CAPTL_gm = 0xFF ; TC16 Capture Value Low Byte group mask
.equ XCL_CAPTL_gp = 0 ; TC16 Capture Value Low Byte group position
.equ XCL_CAPTL0_bm = (1<<0) ; TC16 Capture Value Low Byte bit 0 mask
.equ XCL_CAPTL0_bp = 0 ; TC16 Capture Value Low Byte bit 0 position
.equ XCL_CAPTL1_bm = (1<<1) ; TC16 Capture Value Low Byte bit 1 mask
.equ XCL_CAPTL1_bp = 1 ; TC16 Capture Value Low Byte bit 1 position
.equ XCL_CAPTL2_bm = (1<<2) ; TC16 Capture Value Low Byte bit 2 mask
.equ XCL_CAPTL2_bp = 2 ; TC16 Capture Value Low Byte bit 2 position
.equ XCL_CAPTL3_bm = (1<<3) ; TC16 Capture Value Low Byte bit 3 mask
.equ XCL_CAPTL3_bp = 3 ; TC16 Capture Value Low Byte bit 3 position
.equ XCL_CAPTL4_bm = (1<<4) ; TC16 Capture Value Low Byte bit 4 mask
.equ XCL_CAPTL4_bp = 4 ; TC16 Capture Value Low Byte bit 4 position
.equ XCL_CAPTL5_bm = (1<<5) ; TC16 Capture Value Low Byte bit 5 mask
.equ XCL_CAPTL5_bp = 5 ; TC16 Capture Value Low Byte bit 5 position
.equ XCL_CAPTL6_bm = (1<<6) ; TC16 Capture Value Low Byte bit 6 mask
.equ XCL_CAPTL6_bp = 6 ; TC16 Capture Value Low Byte bit 6 position
.equ XCL_CAPTL7_bm = (1<<7) ; TC16 Capture Value Low Byte bit 7 mask
.equ XCL_CAPTL7_bp = 7 ; TC16 Capture Value Low Byte bit 7 position
.equ XCL_BPER0_gm = 0xFF ; BTC0 Period group mask
.equ XCL_BPER0_gp = 0 ; BTC0 Period group position
.equ XCL_BPER00_bm = (1<<0) ; BTC0 Period bit 0 mask
.equ XCL_BPER00_bp = 0 ; BTC0 Period bit 0 position
.equ XCL_BPER01_bm = (1<<1) ; BTC0 Period bit 1 mask
.equ XCL_BPER01_bp = 1 ; BTC0 Period bit 1 position
.equ XCL_BPER02_bm = (1<<2) ; BTC0 Period bit 2 mask
.equ XCL_BPER02_bp = 2 ; BTC0 Period bit 2 position
.equ XCL_BPER03_bm = (1<<3) ; BTC0 Period bit 3 mask
.equ XCL_BPER03_bp = 3 ; BTC0 Period bit 3 position
.equ XCL_BPER04_bm = (1<<4) ; BTC0 Period bit 4 mask
.equ XCL_BPER04_bp = 4 ; BTC0 Period bit 4 position
.equ XCL_BPER05_bm = (1<<5) ; BTC0 Period bit 5 mask
.equ XCL_BPER05_bp = 5 ; BTC0 Period bit 5 position
.equ XCL_BPER06_bm = (1<<6) ; BTC0 Period bit 6 mask
.equ XCL_BPER06_bp = 6 ; BTC0 Period bit 6 position
.equ XCL_BPER07_bm = (1<<7) ; BTC0 Period bit 7 mask
.equ XCL_BPER07_bp = 7 ; BTC0 Period bit 7 position
.equ XCL_BCAPT0_gm = 0xFF ; BTC0 Capture Value Byte group mask
.equ XCL_BCAPT0_gp = 0 ; BTC0 Capture Value Byte group position
.equ XCL_BCAPT00_bm = (1<<0) ; BTC0 Capture Value Byte bit 0 mask
.equ XCL_BCAPT00_bp = 0 ; BTC0 Capture Value Byte bit 0 position
.equ XCL_BCAPT01_bm = (1<<1) ; BTC0 Capture Value Byte bit 1 mask
.equ XCL_BCAPT01_bp = 1 ; BTC0 Capture Value Byte bit 1 position
.equ XCL_BCAPT02_bm = (1<<2) ; BTC0 Capture Value Byte bit 2 mask
.equ XCL_BCAPT02_bp = 2 ; BTC0 Capture Value Byte bit 2 position
.equ XCL_BCAPT03_bm = (1<<3) ; BTC0 Capture Value Byte bit 3 mask
.equ XCL_BCAPT03_bp = 3 ; BTC0 Capture Value Byte bit 3 position
.equ XCL_BCAPT04_bm = (1<<4) ; BTC0 Capture Value Byte bit 4 mask
.equ XCL_BCAPT04_bp = 4 ; BTC0 Capture Value Byte bit 4 position
.equ XCL_BCAPT05_bm = (1<<5) ; BTC0 Capture Value Byte bit 5 mask
.equ XCL_BCAPT05_bp = 5 ; BTC0 Capture Value Byte bit 5 position
.equ XCL_BCAPT06_bm = (1<<6) ; BTC0 Capture Value Byte bit 6 mask
.equ XCL_BCAPT06_bp = 6 ; BTC0 Capture Value Byte bit 6 position
.equ XCL_BCAPT07_bm = (1<<7) ; BTC0 Capture Value Byte bit 7 mask
.equ XCL_BCAPT07_bp = 7 ; BTC0 Capture Value Byte bit 7 position

; XCL_PERCAPTH masks
.equ XCL_PERH_gm = 0xFF ; TC16 High Byte Period group mask
.equ XCL_PERH_gp = 0 ; TC16 High Byte Period group position
.equ XCL_PERH0_bm = (1<<0) ; TC16 High Byte Period bit 0 mask
.equ XCL_PERH0_bp = 0 ; TC16 High Byte Period bit 0 position
.equ XCL_PERH1_bm = (1<<1) ; TC16 High Byte Period bit 1 mask
.equ XCL_PERH1_bp = 1 ; TC16 High Byte Period bit 1 position
.equ XCL_PERH2_bm = (1<<2) ; TC16 High Byte Period bit 2 mask
.equ XCL_PERH2_bp = 2 ; TC16 High Byte Period bit 2 position
.equ XCL_PERH3_bm = (1<<3) ; TC16 High Byte Period bit 3 mask
.equ XCL_PERH3_bp = 3 ; TC16 High Byte Period bit 3 position
.equ XCL_PERH4_bm = (1<<4) ; TC16 High Byte Period bit 4 mask
.equ XCL_PERH4_bp = 4 ; TC16 High Byte Period bit 4 position
.equ XCL_PERH5_bm = (1<<5) ; TC16 High Byte Period bit 5 mask
.equ XCL_PERH5_bp = 5 ; TC16 High Byte Period bit 5 position
.equ XCL_PERH6_bm = (1<<6) ; TC16 High Byte Period bit 6 mask
.equ XCL_PERH6_bp = 6 ; TC16 High Byte Period bit 6 position
.equ XCL_PERH7_bm = (1<<7) ; TC16 High Byte Period bit 7 mask
.equ XCL_PERH7_bp = 7 ; TC16 High Byte Period bit 7 position
.equ XCL_CAPTH_gm = 0xFF ; TC16 Capture Value High Byte group mask
.equ XCL_CAPTH_gp = 0 ; TC16 Capture Value High Byte group position
.equ XCL_CAPTH0_bm = (1<<0) ; TC16 Capture Value High Byte bit 0 mask
.equ XCL_CAPTH0_bp = 0 ; TC16 Capture Value High Byte bit 0 position
.equ XCL_CAPTH1_bm = (1<<1) ; TC16 Capture Value High Byte bit 1 mask
.equ XCL_CAPTH1_bp = 1 ; TC16 Capture Value High Byte bit 1 position
.equ XCL_CAPTH2_bm = (1<<2) ; TC16 Capture Value High Byte bit 2 mask
.equ XCL_CAPTH2_bp = 2 ; TC16 Capture Value High Byte bit 2 position
.equ XCL_CAPTH3_bm = (1<<3) ; TC16 Capture Value High Byte bit 3 mask
.equ XCL_CAPTH3_bp = 3 ; TC16 Capture Value High Byte bit 3 position
.equ XCL_CAPTH4_bm = (1<<4) ; TC16 Capture Value High Byte bit 4 mask
.equ XCL_CAPTH4_bp = 4 ; TC16 Capture Value High Byte bit 4 position
.equ XCL_CAPTH5_bm = (1<<5) ; TC16 Capture Value High Byte bit 5 mask
.equ XCL_CAPTH5_bp = 5 ; TC16 Capture Value High Byte bit 5 position
.equ XCL_CAPTH6_bm = (1<<6) ; TC16 Capture Value High Byte bit 6 mask
.equ XCL_CAPTH6_bp = 6 ; TC16 Capture Value High Byte bit 6 position
.equ XCL_CAPTH7_bm = (1<<7) ; TC16 Capture Value High Byte bit 7 mask
.equ XCL_CAPTH7_bp = 7 ; TC16 Capture Value High Byte bit 7 position
.equ XCL_BPER1_gm = 0xFF ; BTC1 Period group mask
.equ XCL_BPER1_gp = 0 ; BTC1 Period group position
.equ XCL_BPER10_bm = (1<<0) ; BTC1 Period bit 0 mask
.equ XCL_BPER10_bp = 0 ; BTC1 Period bit 0 position
.equ XCL_BPER11_bm = (1<<1) ; BTC1 Period bit 1 mask
.equ XCL_BPER11_bp = 1 ; BTC1 Period bit 1 position
.equ XCL_BPER12_bm = (1<<2) ; BTC1 Period bit 2 mask
.equ XCL_BPER12_bp = 2 ; BTC1 Period bit 2 position
.equ XCL_BPER13_bm = (1<<3) ; BTC1 Period bit 3 mask
.equ XCL_BPER13_bp = 3 ; BTC1 Period bit 3 position
.equ XCL_BPER14_bm = (1<<4) ; BTC1 Period bit 4 mask
.equ XCL_BPER14_bp = 4 ; BTC1 Period bit 4 position
.equ XCL_BPER15_bm = (1<<5) ; BTC1 Period bit 5 mask
.equ XCL_BPER15_bp = 5 ; BTC1 Period bit 5 position
.equ XCL_BPER16_bm = (1<<6) ; BTC1 Period bit 6 mask
.equ XCL_BPER16_bp = 6 ; BTC1 Period bit 6 position
.equ XCL_BPER17_bm = (1<<7) ; BTC1 Period bit 7 mask
.equ XCL_BPER17_bp = 7 ; BTC1 Period bit 7 position
.equ XCL_BCAPT1_gm = 0xFF ; BTC1 Capture Value Byte group mask
.equ XCL_BCAPT1_gp = 0 ; BTC1 Capture Value Byte group position
.equ XCL_BCAPT10_bm = (1<<0) ; BTC1 Capture Value Byte bit 0 mask
.equ XCL_BCAPT10_bp = 0 ; BTC1 Capture Value Byte bit 0 position
.equ XCL_BCAPT11_bm = (1<<1) ; BTC1 Capture Value Byte bit 1 mask
.equ XCL_BCAPT11_bp = 1 ; BTC1 Capture Value Byte bit 1 position
.equ XCL_BCAPT12_bm = (1<<2) ; BTC1 Capture Value Byte bit 2 mask
.equ XCL_BCAPT12_bp = 2 ; BTC1 Capture Value Byte bit 2 position
.equ XCL_BCAPT13_bm = (1<<3) ; BTC1 Capture Value Byte bit 3 mask
.equ XCL_BCAPT13_bp = 3 ; BTC1 Capture Value Byte bit 3 position
.equ XCL_BCAPT14_bm = (1<<4) ; BTC1 Capture Value Byte bit 4 mask
.equ XCL_BCAPT14_bp = 4 ; BTC1 Capture Value Byte bit 4 position
.equ XCL_BCAPT15_bm = (1<<5) ; BTC1 Capture Value Byte bit 5 mask
.equ XCL_BCAPT15_bp = 5 ; BTC1 Capture Value Byte bit 5 position
.equ XCL_BCAPT16_bm = (1<<6) ; BTC1 Capture Value Byte bit 6 mask
.equ XCL_BCAPT16_bp = 6 ; BTC1 Capture Value Byte bit 6 position
.equ XCL_BCAPT17_bm = (1<<7) ; BTC1 Capture Value Byte bit 7 mask
.equ XCL_BCAPT17_bp = 7 ; BTC1 Capture Value Byte bit 7 position

; LUT0 Output Enable
.equ XCL_LUTOUTEN_DISABLE_gc = (0x00<<6) ; LUT0 output disabled
.equ XCL_LUTOUTEN_PIN0_gc = (0x01<<6) ; LUT0 Output to pin 0
.equ XCL_LUTOUTEN_PIN4_gc = (0x02<<6) ; LUT0 Output to pin 4

; Port Selection
.equ XCL_PORTSEL_PC_gc = (0x00<<4) ; Port C for LUT or USARTC0 for PEC
.equ XCL_PORTSEL_PD_gc = (0x01<<4) ; Port D for LUT or USARTD0 for PEC

; LUT Configuration
.equ XCL_LUTCONF_2LUT2IN_gc = (0x00<<0) ; 2-Input two LUT
.equ XCL_LUTCONF_2LUT1IN_gc = (0x01<<0) ; Two LUT with duplicated input 
.equ XCL_LUTCONF_2LUT3IN_gc = (0x02<<0) ; Two LUT with one common input 
.equ XCL_LUTCONF_1LUT3IN_gc = (0x03<<0) ; 3-Input LUT 
.equ XCL_LUTCONF_MUX_gc = (0x04<<0) ; One LUT Mux 
.equ XCL_LUTCONF_DLATCH_gc = (0x05<<0) ; One D-Latch LUT 
.equ XCL_LUTCONF_RSLATCH_gc = (0x06<<0) ; One RS-Latch LUT 
.equ XCL_LUTCONF_DFF_gc = (0x07<<0) ; One DFF LUT 

; Input Selection
.equ XCL_INSEL_EVSYS_gc = (0x00<<0) ; Event system selected as source
.equ XCL_INSEL_XCL_gc = (0x01<<0) ; XCL selected as source
.equ XCL_INSEL_PINL_gc = (0x02<<0) ; LSB port pin selected as source
.equ XCL_INSEL_PINH_gc = (0x03<<0) ; MSB port pin selected as source

; Delay Configuration on LUT
.equ XCL_DLYCONF_DISABLE_gc = (0x00<<0) ; Delay element disabled
.equ XCL_DLYCONF_IN_gc = (0x01<<0) ; Delay enabled on LUT input
.equ XCL_DLYCONF_OUT_gc = (0x02<<0) ; Delay enabled on LUT output

; Delay Selection
.equ XCL_DLYSEL_DLY11_gc = (0x00<<4) ; One cycle delay for each LUT1 and LUT0
.equ XCL_DLYSEL_DLY12_gc = (0x01<<4) ; One cycle delay for LUT1 and two cycles for LUT0
.equ XCL_DLYSEL_DLY21_gc = (0x02<<4) ; Two cycles delay for LUT1 and one cycle for LUT0
.equ XCL_DLYSEL_DLY22_gc = (0x03<<4) ; Two cycle delays for each LUT1 and LUT0

