trol73/avr-make/asm/include/ATxmega16E5def.inc
; Clock Selection
.equ XCL_CLKSEL_OFF_gc = (0x00<<0) ; OFF
.equ XCL_CLKSEL_DIV1_gc = (0x01<<0) ; Prescaler clk
.equ XCL_CLKSEL_DIV2_gc = (0x02<<0) ; Prescaler clk/2
.equ XCL_CLKSEL_DIV4_gc = (0x03<<0) ; Prescaler clk/4
.equ XCL_CLKSEL_DIV8_gc = (0x04<<0) ; Prescaler clk/8
.equ XCL_CLKSEL_DIV64_gc = (0x05<<0) ; Prescaler clk/64
.equ XCL_CLKSEL_DIV256_gc = (0x06<<0) ; Prescaler clk/256
.equ XCL_CLKSEL_DIV1024_gc = (0x07<<0) ; Prescaler clk/1024
.equ XCL_CLKSEL_EVCH0_gc = (0x08<<0) ; Event channel 0
.equ XCL_CLKSEL_EVCH1_gc = (0x09<<0) ; Event channel 1
.equ XCL_CLKSEL_EVCH2_gc = (0x0A<<0) ; Event channel 2
.equ XCL_CLKSEL_EVCH3_gc = (0x0B<<0) ; Event channel 3
.equ XCL_CLKSEL_EVCH4_gc = (0x0C<<0) ; Event channel 4
.equ XCL_CLKSEL_EVCH5_gc = (0x0D<<0) ; Event channel 5
.equ XCL_CLKSEL_EVCH6_gc = (0x0E<<0) ; Event channel 6
.equ XCL_CLKSEL_EVCH7_gc = (0x0F<<0) ; Event channel 7

; Timer/Counter Command Selection
.equ XCL_CMDSEL_NONE_gc = (0x00<<7) ; None
.equ XCL_CMDSEL_RESTART_gc = (0x01<<7) ; Force restart

; Timer/Counter Selection
.equ XCL_TCSEL_TC16_gc = (0x00<<4) ; 16-bit timer/counter
.equ XCL_TCSEL_BTC0_gc = (0x01<<4) ; One 8-bit timer/counter
.equ XCL_TCSEL_BTC01_gc = (0x02<<4) ; Two 8-bit timer/counters
.equ XCL_TCSEL_BTC0PEC1_gc = (0x03<<4) ; One 8-bit timer/counter and one 8-bit peripheral counter
.equ XCL_TCSEL_PEC0BTC1_gc = (0x04<<4) ; One 8-bit timer/counter and one 8-bit peripheral counter
.equ XCL_TCSEL_PEC01_gc = (0x05<<4) ; Two 8-bit peripheral counters
.equ XCL_TCSEL_BTC0PEC2_gc = (0x06<<4) ; One 8-bit timer/counter and two 4-bit peripheral counters

; Timer/Counter Mode
.equ XCL_TCMODE_NORMAL_gc = (0x00<<0) ; Normal mode with compare/period
.equ XCL_TCMODE_CAPT_gc = (0x01<<0) ; Capture mode
.equ XCL_TCMODE_PWM_gc = (0x02<<0) ; Single Slope PWM

; Compare Output Value Timer
.equ XCL_CMPEN_CLEAR_gc = (0x00<<4) ; Clear WG Output 
.equ XCL_CMPEN_SET_gc = (0x01<<4) ; Set WG Output 

; Command Enable
.equ XCL_CMDEN_DISABLE_gc = (0x00<<6) ; Command Ignored
.equ XCL_CMDEN_CMD0_gc = (0x01<<6) ; Command valid for timer/counter 0
.equ XCL_CMDEN_CMD1_gc = (0x02<<6) ; Command valid for timer/counter 1
.equ XCL_CMDEN_CMD01_gc = (0x03<<6) ; Command valid for both timer/counter 0 and 1

; Timer/Counter Event Source Selection
.equ XCL_EVSRC_EVCH0_gc = (0x00<<0) ; Event channel 0
.equ XCL_EVSRC_EVCH1_gc = (0x01<<0) ; Event channel 1
.equ XCL_EVSRC_EVCH2_gc = (0x02<<0) ; Event channel 2
.equ XCL_EVSRC_EVCH3_gc = (0x03<<0) ; Event channel 3
.equ XCL_EVSRC_EVCH4_gc = (0x04<<0) ; Event channel 4
.equ XCL_EVSRC_EVCH5_gc = (0x05<<0) ; Event channel 5
.equ XCL_EVSRC_EVCH6_gc = (0x06<<0) ; Event channel 6
.equ XCL_EVSRC_EVCH7_gc = (0x07<<0) ; Event channel 7

; Timer/Counter Event Action Selection
.equ XCL_EVACT_INPUT_gc = (0x00<<3) ; Input Capture
.equ XCL_EVACT_FREQ_gc = (0x01<<3) ; Frequency Capture
.equ XCL_EVACT_PW_gc = (0x02<<3) ; Pulse Width Capture
.equ XCL_EVACT_RESTART_gc = (0x03<<3) ; Restart timer/counter

; Underflow Interrupt level
.equ XCL_UNF_INTLVL_OFF_gc = (0x00<<2) ; Interrupt Disabled
.equ XCL_UNF_INTLVL_LO_gc = (0x01<<2) ; Low Level
.equ XCL_UNF_INTLVL_MED_gc = (0x02<<2) ; Medium Level
.equ XCL_UNF_INTLVL_HI_gc = (0x03<<2) ; High Level

; Compare/Capture Interrupt level
.equ XCL_CC_INTLVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ XCL_CC_INTLVL_LO_gc = (0x01<<0) ; Low Level
.equ XCL_CC_INTLVL_MED_gc = (0x02<<0) ; Medium Level
.equ XCL_CC_INTLVL_HI_gc = (0x03<<0) ; High Level


;*************************************************************************
;** TWI - Two-Wire Interface
;*************************************************************************

; TWI_CTRL masks
.equ TWI_BRIDGEEN_bm = 0x80 ; Bridge Enable bit mask
.equ TWI_BRIDGEEN_bp = 7 ; Bridge Enable bit position
.equ TWI_SFMPEN_bm = 0x40 ; Slave Fast Mode Plus Enable bit mask
.equ TWI_SFMPEN_bp = 6 ; Slave Fast Mode Plus Enable bit position
.equ TWI_SSDAHOLD_gm = 0x30 ; Slave SDA Hold Time Enable group mask
.equ TWI_SSDAHOLD_gp = 4 ; Slave SDA Hold Time Enable group position
.equ TWI_SSDAHOLD0_bm = (1<<4) ; Slave SDA Hold Time Enable bit 0 mask
.equ TWI_SSDAHOLD0_bp = 4 ; Slave SDA Hold Time Enable bit 0 position
.equ TWI_SSDAHOLD1_bm = (1<<5) ; Slave SDA Hold Time Enable bit 1 mask
.equ TWI_SSDAHOLD1_bp = 5 ; Slave SDA Hold Time Enable bit 1 position
.equ TWI_FMPEN_bm = 0x08 ; FMPLUS Enable bit mask
.equ TWI_FMPEN_bp = 3 ; FMPLUS Enable bit position
.equ TWI_SDAHOLD_gm = 0x06 ; SDA Hold Time Enable group mask
.equ TWI_SDAHOLD_gp = 1 ; SDA Hold Time Enable group position
.equ TWI_SDAHOLD0_bm = (1<<1) ; SDA Hold Time Enable bit 0 mask
.equ TWI_SDAHOLD0_bp = 1 ; SDA Hold Time Enable bit 0 position
.equ TWI_SDAHOLD1_bm = (1<<2) ; SDA Hold Time Enable bit 1 mask
.equ TWI_SDAHOLD1_bp = 2 ; SDA Hold Time Enable bit 1 position
.equ TWI_EDIEN_bm = 0x01 ; External Driver Interface Enable bit mask
.equ TWI_EDIEN_bp = 0 ; External Driver Interface Enable bit position

; TWI_MASTER_CTRLA masks
.equ TWI_MASTER_INTLVL_gm = 0xC0 ; Interrupt Level group mask
.equ TWI_MASTER_INTLVL_gp = 6 ; Interrupt Level group position
.equ TWI_MASTER_INTLVL0_bm = (1<<6) ; Interrupt Level bit 0 mask
.equ TWI_MASTER_INTLVL0_bp = 6 ; Interrupt Level bit 0 position
.equ TWI_MASTER_INTLVL1_bm = (1<<7) ; Interrupt Level bit 1 mask
.equ TWI_MASTER_INTLVL1_bp = 7 ; Interrupt Level bit 1 position
.equ TWI_MASTER_RIEN_bm = 0x20 ; Read Interrupt Enable bit mask
.equ TWI_MASTER_RIEN_bp = 5 ; Read Interrupt Enable bit position
.equ TWI_MASTER_WIEN_bm = 0x10 ; Write Interrupt Enable bit mask
.equ TWI_MASTER_WIEN_bp = 4 ; Write Interrupt Enable bit position
.equ TWI_MASTER_ENABLE_bm = 0x08 ; Enable TWI Master bit mask
.equ TWI_MASTER_ENABLE_bp = 3 ; Enable TWI Master bit position

; TWI_MASTER_CTRLB masks
.equ TWI_MASTER_TIMEOUT_gm = 0x0C ; Inactive Bus Timeout group mask
.equ TWI_MASTER_TIMEOUT_gp = 2 ; Inactive Bus Timeout group position
.equ TWI_MASTER_TIMEOUT0_bm = (1<<2) ; Inactive Bus Timeout bit 0 mask
.equ TWI_MASTER_TIMEOUT0_bp = 2 ; Inactive Bus Timeout bit 0 position
.equ TWI_MASTER_TIMEOUT1_bm = (1<<3) ; Inactive Bus Timeout bit 1 mask
.equ TWI_MASTER_TIMEOUT1_bp = 3 ; Inactive Bus Timeout bit 1 position
.equ TWI_MASTER_QCEN_bm = 0x02 ; Quick Command Enable bit mask
.equ TWI_MASTER_QCEN_bp = 1 ; Quick Command Enable bit position
.equ TWI_MASTER_SMEN_bm = 0x01 ; Smart Mode Enable bit mask
.equ TWI_MASTER_SMEN_bp = 0 ; Smart Mode Enable bit position

; TWI_MASTER_CTRLC masks
.equ TWI_MASTER_ACKACT_bm = 0x04 ; Acknowledge Action bit mask
.equ TWI_MASTER_ACKACT_bp = 2 ; Acknowledge Action bit position
.equ TWI_MASTER_CMD_gm = 0x03 ; Command group mask
.equ TWI_MASTER_CMD_gp = 0 ; Command group position
.equ TWI_MASTER_CMD0_bm = (1<<0) ; Command bit 0 mask
.equ TWI_MASTER_CMD0_bp = 0 ; Command bit 0 position
.equ TWI_MASTER_CMD1_bm = (1<<1) ; Command bit 1 mask
.equ TWI_MASTER_CMD1_bp = 1 ; Command bit 1 position

; TWI_MASTER_STATUS masks
.equ TWI_MASTER_RIF_bm = 0x80 ; Read Interrupt Flag bit mask
.equ TWI_MASTER_RIF_bp = 7 ; Read Interrupt Flag bit position
.equ TWI_MASTER_WIF_bm = 0x40 ; Write Interrupt Flag bit mask
.equ TWI_MASTER_WIF_bp = 6 ; Write Interrupt Flag bit position
.equ TWI_MASTER_CLKHOLD_bm = 0x20 ; Clock Hold bit mask
.equ TWI_MASTER_CLKHOLD_bp = 5 ; Clock Hold bit position
.equ TWI_MASTER_RXACK_bm = 0x10 ; Received Acknowledge bit mask
.equ TWI_MASTER_RXACK_bp = 4 ; Received Acknowledge bit position
.equ TWI_MASTER_ARBLOST_bm = 0x08 ; Arbitration Lost bit mask
.equ TWI_MASTER_ARBLOST_bp = 3 ; Arbitration Lost bit position
.equ TWI_MASTER_BUSERR_bm = 0x04 ; Bus Error bit mask
.equ TWI_MASTER_BUSERR_bp = 2 ; Bus Error bit position
.equ TWI_MASTER_BUSSTATE_gm = 0x03 ; Bus State group mask
.equ TWI_MASTER_BUSSTATE_gp = 0 ; Bus State group position
.equ TWI_MASTER_BUSSTATE0_bm = (1<<0) ; Bus State bit 0 mask
.equ TWI_MASTER_BUSSTATE0_bp = 0 ; Bus State bit 0 position
.equ TWI_MASTER_BUSSTATE1_bm = (1<<1) ; Bus State bit 1 mask
.equ TWI_MASTER_BUSSTATE1_bp = 1 ; Bus State bit 1 position

; TWI_SLAVE_CTRLA masks
.equ TWI_SLAVE_INTLVL_gm = 0xC0 ; Interrupt Level group mask
.equ TWI_SLAVE_INTLVL_gp = 6 ; Interrupt Level group position
.equ TWI_SLAVE_INTLVL0_bm = (1<<6) ; Interrupt Level bit 0 mask
.equ TWI_SLAVE_INTLVL0_bp = 6 ; Interrupt Level bit 0 position
.equ TWI_SLAVE_INTLVL1_bm = (1<<7) ; Interrupt Level bit 1 mask
.equ TWI_SLAVE_INTLVL1_bp = 7 ; Interrupt Level bit 1 position
.equ TWI_SLAVE_DIEN_bm = 0x20 ; Data Interrupt Enable bit mask
.equ TWI_SLAVE_DIEN_bp = 5 ; Data Interrupt Enable bit position
.equ TWI_SLAVE_APIEN_bm = 0x10 ; Address/Stop Interrupt Enable bit mask
.equ TWI_SLAVE_APIEN_bp = 4 ; Address/Stop Interrupt Enable bit position
.equ TWI_SLAVE_ENABLE_bm = 0x08 ; Enable TWI Slave bit mask
.equ TWI_SLAVE_ENABLE_bp = 3 ; Enable TWI Slave bit position
.equ TWI_SLAVE_PIEN_bm = 0x04 ; Stop Interrupt Enable bit mask
.equ TWI_SLAVE_PIEN_bp = 2 ; Stop Interrupt Enable bit position
.equ TWI_SLAVE_PMEN_bm = 0x02 ; Promiscuous Mode Enable bit mask
.equ TWI_SLAVE_PMEN_bp = 1 ; Promiscuous Mode Enable bit position
.equ TWI_SLAVE_SMEN_bm = 0x01 ; Smart Mode Enable bit mask
.equ TWI_SLAVE_SMEN_bp = 0 ; Smart Mode Enable bit position

; TWI_SLAVE_CTRLB masks
.equ TWI_SLAVE_ACKACT_bm = 0x04 ; Acknowledge Action bit mask
.equ TWI_SLAVE_ACKACT_bp = 2 ; Acknowledge Action bit position
.equ TWI_SLAVE_CMD_gm = 0x03 ; Command group mask
.equ TWI_SLAVE_CMD_gp = 0 ; Command group position
.equ TWI_SLAVE_CMD0_bm = (1<<0) ; Command bit 0 mask
.equ TWI_SLAVE_CMD0_bp = 0 ; Command bit 0 position
.equ TWI_SLAVE_CMD1_bm = (1<<1) ; Command bit 1 mask
.equ TWI_SLAVE_CMD1_bp = 1 ; Command bit 1 position

; TWI_SLAVE_STATUS masks
.equ TWI_SLAVE_DIF_bm = 0x80 ; Data Interrupt Flag bit mask
.equ TWI_SLAVE_DIF_bp = 7 ; Data Interrupt Flag bit position
.equ TWI_SLAVE_APIF_bm = 0x40 ; Address/Stop Interrupt Flag bit mask
.equ TWI_SLAVE_APIF_bp = 6 ; Address/Stop Interrupt Flag bit position
.equ TWI_SLAVE_CLKHOLD_bm = 0x20 ; Clock Hold bit mask
.equ TWI_SLAVE_CLKHOLD_bp = 5 ; Clock Hold bit position
.equ TWI_SLAVE_RXACK_bm = 0x10 ; Received Acknowledge bit mask
.equ TWI_SLAVE_RXACK_bp = 4 ; Received Acknowledge bit position
.equ TWI_SLAVE_COLL_bm = 0x08 ; Collision bit mask
.equ TWI_SLAVE_COLL_bp = 3 ; Collision bit position
.equ TWI_SLAVE_BUSERR_bm = 0x04 ; Bus Error bit mask
.equ TWI_SLAVE_BUSERR_bp = 2 ; Bus Error bit position
.equ TWI_SLAVE_DIR_bm = 0x02 ; Read/Write Direction bit mask
.equ TWI_SLAVE_DIR_bp = 1 ; Read/Write Direction bit position
.equ TWI_SLAVE_AP_bm = 0x01 ; Slave Address or Stop bit mask
.equ TWI_SLAVE_AP_bp = 0 ; Slave Address or Stop bit position

; TWI_SLAVE_ADDRMASK masks
.equ TWI_SLAVE_ADDRMASK_gm = 0xFE ; Address Mask group mask
.equ TWI_SLAVE_ADDRMASK_gp = 1 ; Address Mask group position
.equ TWI_SLAVE_ADDRMASK0_bm = (1<<1) ; Address Mask bit 0 mask
.equ TWI_SLAVE_ADDRMASK0_bp = 1 ; Address Mask bit 0 position
.equ TWI_SLAVE_ADDRMASK1_bm = (1<<2) ; Address Mask bit 1 mask
.equ TWI_SLAVE_ADDRMASK1_bp = 2 ; Address Mask bit 1 position
.equ TWI_SLAVE_ADDRMASK2_bm = (1<<3) ; Address Mask bit 2 mask
.equ TWI_SLAVE_ADDRMASK2_bp = 3 ; Address Mask bit 2 position
.equ TWI_SLAVE_ADDRMASK3_bm = (1<<4) ; Address Mask bit 3 mask
.equ TWI_SLAVE_ADDRMASK3_bp = 4 ; Address Mask bit 3 position
.equ TWI_SLAVE_ADDRMASK4_bm = (1<<5) ; Address Mask bit 4 mask
.equ TWI_SLAVE_ADDRMASK4_bp = 5 ; Address Mask bit 4 position
.equ TWI_SLAVE_ADDRMASK5_bm = (1<<6) ; Address Mask bit 5 mask
.equ TWI_SLAVE_ADDRMASK5_bp = 6 ; Address Mask bit 5 position
.equ TWI_SLAVE_ADDRMASK6_bm = (1<<7) ; Address Mask bit 6 mask
.equ TWI_SLAVE_ADDRMASK6_bp = 7 ; Address Mask bit 6 position
.equ TWI_SLAVE_ADDREN_bm = 0x01 ; Address Enable bit mask
.equ TWI_SLAVE_ADDREN_bp = 0 ; Address Enable bit position

; SDA Hold Time
.equ TWI_SDAHOLD_OFF_gc = (0x00<<1) ; SDA Hold Time off
.equ TWI_SDAHOLD_50NS_gc = (0x01<<1) ; SDA Hold Time 50 ns
.equ TWI_SDAHOLD_300NS_gc = (0x02<<1) ; SDA Hold Time 300 ns
.equ TWI_SDAHOLD_400NS_gc = (0x03<<1) ; SDA Hold Time 400 ns

; Master Interrupt Level
.equ TWI_MASTER_INTLVL_OFF_gc = (0x00<<6) ; Interrupt Disabled
.equ TWI_MASTER_INTLVL_LO_gc = (0x01<<6) ; Low Level
.equ TWI_MASTER_INTLVL_MED_gc = (0x02<<6) ; Medium Level
.equ TWI_MASTER_INTLVL_HI_gc = (0x03<<6) ; High Level

