trol73/avr-make/asm/include/ATxmega16E5def.inc
; TC5_CTRLD masks
.equ TC5_EVACT_gm = 0xE0 ; Event Action group mask
.equ TC5_EVACT_gp = 5 ; Event Action group position
.equ TC5_EVACT0_bm = (1<<5) ; Event Action bit 0 mask
.equ TC5_EVACT0_bp = 5 ; Event Action bit 0 position
.equ TC5_EVACT1_bm = (1<<6) ; Event Action bit 1 mask
.equ TC5_EVACT1_bp = 6 ; Event Action bit 1 position
.equ TC5_EVACT2_bm = (1<<7) ; Event Action bit 2 mask
.equ TC5_EVACT2_bp = 7 ; Event Action bit 2 position
.equ TC5_EVDLY_bm = 0x10 ; Event Delay bit mask
.equ TC5_EVDLY_bp = 4 ; Event Delay bit position
.equ TC5_EVSEL_gm = 0x0F ; Event Source Select group mask
.equ TC5_EVSEL_gp = 0 ; Event Source Select group position
.equ TC5_EVSEL0_bm = (1<<0) ; Event Source Select bit 0 mask
.equ TC5_EVSEL0_bp = 0 ; Event Source Select bit 0 position
.equ TC5_EVSEL1_bm = (1<<1) ; Event Source Select bit 1 mask
.equ TC5_EVSEL1_bp = 1 ; Event Source Select bit 1 position
.equ TC5_EVSEL2_bm = (1<<2) ; Event Source Select bit 2 mask
.equ TC5_EVSEL2_bp = 2 ; Event Source Select bit 2 position
.equ TC5_EVSEL3_bm = (1<<3) ; Event Source Select bit 3 mask
.equ TC5_EVSEL3_bp = 3 ; Event Source Select bit 3 position

; TC5_CTRLE masks
.equ TC5_CCBMODE_gm = 0x0C ; Channel B Compare or Capture Mode group mask
.equ TC5_CCBMODE_gp = 2 ; Channel B Compare or Capture Mode group position
.equ TC5_CCBMODE0_bm = (1<<2) ; Channel B Compare or Capture Mode bit 0 mask
.equ TC5_CCBMODE0_bp = 2 ; Channel B Compare or Capture Mode bit 0 position
.equ TC5_CCBMODE1_bm = (1<<3) ; Channel B Compare or Capture Mode bit 1 mask
.equ TC5_CCBMODE1_bp = 3 ; Channel B Compare or Capture Mode bit 1 position
.equ TC5_CCAMODE_gm = 0x03 ; Channel A Compare or Capture Mode group mask
.equ TC5_CCAMODE_gp = 0 ; Channel A Compare or Capture Mode group position
.equ TC5_CCAMODE0_bm = (1<<0) ; Channel A Compare or Capture Mode bit 0 mask
.equ TC5_CCAMODE0_bp = 0 ; Channel A Compare or Capture Mode bit 0 position
.equ TC5_CCAMODE1_bm = (1<<1) ; Channel A Compare or Capture Mode bit 1 mask
.equ TC5_CCAMODE1_bp = 1 ; Channel A Compare or Capture Mode bit 1 position
.equ TC5_LCCBMODE_gm = 0x0C ; Channel Low B Compare or Capture Mode group mask
.equ TC5_LCCBMODE_gp = 2 ; Channel Low B Compare or Capture Mode group position
.equ TC5_LCCBMODE0_bm = (1<<2) ; Channel Low B Compare or Capture Mode bit 0 mask
.equ TC5_LCCBMODE0_bp = 2 ; Channel Low B Compare or Capture Mode bit 0 position
.equ TC5_LCCBMODE1_bm = (1<<3) ; Channel Low B Compare or Capture Mode bit 1 mask
.equ TC5_LCCBMODE1_bp = 3 ; Channel Low B Compare or Capture Mode bit 1 position
.equ TC5_LCCAMODE_gm = 0x03 ; Channel Low A Compare or Capture Mode group mask
.equ TC5_LCCAMODE_gp = 0 ; Channel Low A Compare or Capture Mode group position
.equ TC5_LCCAMODE0_bm = (1<<0) ; Channel Low A Compare or Capture Mode bit 0 mask
.equ TC5_LCCAMODE0_bp = 0 ; Channel Low A Compare or Capture Mode bit 0 position
.equ TC5_LCCAMODE1_bm = (1<<1) ; Channel Low A Compare or Capture Mode bit 1 mask
.equ TC5_LCCAMODE1_bp = 1 ; Channel Low A Compare or Capture Mode bit 1 position

; TC5_CTRLF masks
.equ TC5_HCCBMODE_gm = 0x0C ; Channel High B Compare or Capture Mode group mask
.equ TC5_HCCBMODE_gp = 2 ; Channel High B Compare or Capture Mode group position
.equ TC5_HCCBMODE0_bm = (1<<2) ; Channel High B Compare or Capture Mode bit 0 mask
.equ TC5_HCCBMODE0_bp = 2 ; Channel High B Compare or Capture Mode bit 0 position
.equ TC5_HCCBMODE1_bm = (1<<3) ; Channel High B Compare or Capture Mode bit 1 mask
.equ TC5_HCCBMODE1_bp = 3 ; Channel High B Compare or Capture Mode bit 1 position
.equ TC5_HCCAMODE_gm = 0x03 ; Channel High A Compare or Capture Mode group mask
.equ TC5_HCCAMODE_gp = 0 ; Channel High A Compare or Capture Mode group position
.equ TC5_HCCAMODE0_bm = (1<<0) ; Channel High A Compare or Capture Mode bit 0 mask
.equ TC5_HCCAMODE0_bp = 0 ; Channel High A Compare or Capture Mode bit 0 position
.equ TC5_HCCAMODE1_bm = (1<<1) ; Channel High A Compare or Capture Mode bit 1 mask
.equ TC5_HCCAMODE1_bp = 1 ; Channel High A Compare or Capture Mode bit 1 position

; TC5_INTCTRLA masks
.equ TC5_TRGINTLVL_gm = 0x30 ; Timer Trigger Restart Interrupt Level group mask
.equ TC5_TRGINTLVL_gp = 4 ; Timer Trigger Restart Interrupt Level group position
.equ TC5_TRGINTLVL0_bm = (1<<4) ; Timer Trigger Restart Interrupt Level bit 0 mask
.equ TC5_TRGINTLVL0_bp = 4 ; Timer Trigger Restart Interrupt Level bit 0 position
.equ TC5_TRGINTLVL1_bm = (1<<5) ; Timer Trigger Restart Interrupt Level bit 1 mask
.equ TC5_TRGINTLVL1_bp = 5 ; Timer Trigger Restart Interrupt Level bit 1 position
.equ TC5_ERRINTLVL_gm = 0x0C ; Timer Error Interrupt Level group mask
.equ TC5_ERRINTLVL_gp = 2 ; Timer Error Interrupt Level group position
.equ TC5_ERRINTLVL0_bm = (1<<2) ; Timer Error Interrupt Level bit 0 mask
.equ TC5_ERRINTLVL0_bp = 2 ; Timer Error Interrupt Level bit 0 position
.equ TC5_ERRINTLVL1_bm = (1<<3) ; Timer Error Interrupt Level bit 1 mask
.equ TC5_ERRINTLVL1_bp = 3 ; Timer Error Interrupt Level bit 1 position
.equ TC5_OVFINTLVL_gm = 0x03 ; Timer Overflow/Underflow Interrupt Level group mask
.equ TC5_OVFINTLVL_gp = 0 ; Timer Overflow/Underflow Interrupt Level group position
.equ TC5_OVFINTLVL0_bm = (1<<0) ; Timer Overflow/Underflow Interrupt Level bit 0 mask
.equ TC5_OVFINTLVL0_bp = 0 ; Timer Overflow/Underflow Interrupt Level bit 0 position
.equ TC5_OVFINTLVL1_bm = (1<<1) ; Timer Overflow/Underflow Interrupt Level bit 1 mask
.equ TC5_OVFINTLVL1_bp = 1 ; Timer Overflow/Underflow Interrupt Level bit 1 position

; TC5_INTCTRLB masks
.equ TC5_CCBINTLVL_gm = 0x0C ; Channel B Compare or Capture Interrupt Level group mask
.equ TC5_CCBINTLVL_gp = 2 ; Channel B Compare or Capture Interrupt Level group position
.equ TC5_CCBINTLVL0_bm = (1<<2) ; Channel B Compare or Capture Interrupt Level bit 0 mask
.equ TC5_CCBINTLVL0_bp = 2 ; Channel B Compare or Capture Interrupt Level bit 0 position
.equ TC5_CCBINTLVL1_bm = (1<<3) ; Channel B Compare or Capture Interrupt Level bit 1 mask
.equ TC5_CCBINTLVL1_bp = 3 ; Channel B Compare or Capture Interrupt Level bit 1 position
.equ TC5_CCAINTLVL_gm = 0x03 ; Channel A Compare or Capture Interrupt Level group mask
.equ TC5_CCAINTLVL_gp = 0 ; Channel A Compare or Capture Interrupt Level group position
.equ TC5_CCAINTLVL0_bm = (1<<0) ; Channel A Compare or Capture Interrupt Level bit 0 mask
.equ TC5_CCAINTLVL0_bp = 0 ; Channel A Compare or Capture Interrupt Level bit 0 position
.equ TC5_CCAINTLVL1_bm = (1<<1) ; Channel A Compare or Capture Interrupt Level bit 1 mask
.equ TC5_CCAINTLVL1_bp = 1 ; Channel A Compare or Capture Interrupt Level bit 1 position
.equ TC5_LCCBINTLVL_gm = 0x0C ; Channel Low B Compare or Capture Interrupt Level group mask
.equ TC5_LCCBINTLVL_gp = 2 ; Channel Low B Compare or Capture Interrupt Level group position
.equ TC5_LCCBINTLVL0_bm = (1<<2) ; Channel Low B Compare or Capture Interrupt Level bit 0 mask
.equ TC5_LCCBINTLVL0_bp = 2 ; Channel Low B Compare or Capture Interrupt Level bit 0 position
.equ TC5_LCCBINTLVL1_bm = (1<<3) ; Channel Low B Compare or Capture Interrupt Level bit 1 mask
.equ TC5_LCCBINTLVL1_bp = 3 ; Channel Low B Compare or Capture Interrupt Level bit 1 position
.equ TC5_LCCAINTLVL_gm = 0x03 ; Channel Low A Compare or Capture Interrupt Level group mask
.equ TC5_LCCAINTLVL_gp = 0 ; Channel Low A Compare or Capture Interrupt Level group position
.equ TC5_LCCAINTLVL0_bm = (1<<0) ; Channel Low A Compare or Capture Interrupt Level bit 0 mask
.equ TC5_LCCAINTLVL0_bp = 0 ; Channel Low A Compare or Capture Interrupt Level bit 0 position
.equ TC5_LCCAINTLVL1_bm = (1<<1) ; Channel Low A Compare or Capture Interrupt Level bit 1 mask
.equ TC5_LCCAINTLVL1_bp = 1 ; Channel Low A Compare or Capture Interrupt Level bit 1 position

; TC5_CTRLGCLR masks
.equ TC5_STOP_bm = 0x10 ; Timer/Counter Stop bit mask
.equ TC5_STOP_bp = 4 ; Timer/Counter Stop bit position
.equ TC5_CMD_gm = 0x0C ; Command group mask
.equ TC5_CMD_gp = 2 ; Command group position
.equ TC5_CMD0_bm = (1<<2) ; Command bit 0 mask
.equ TC5_CMD0_bp = 2 ; Command bit 0 position
.equ TC5_CMD1_bm = (1<<3) ; Command bit 1 mask
.equ TC5_CMD1_bp = 3 ; Command bit 1 position
.equ TC5_LUPD_bm = 0x02 ; Lock Update bit mask
.equ TC5_LUPD_bp = 1 ; Lock Update bit position
.equ TC5_DIR_bm = 0x01 ; Counter Direction bit mask
.equ TC5_DIR_bp = 0 ; Counter Direction bit position

; TC5_CTRLGSET masks
; Masks for TC5_STOP already defined
; Masks for TC5_CMD already defined
; Masks for TC5_LUPD already defined
; Masks for TC5_DIR already defined

