trol73/avr-make/asm/include/ATxmega16E5def.inc
; FAULT_CTRLB masks
.equ FAULT_SOFTA_bm = 0x80 ; Fault A Software Mode bit mask
.equ FAULT_SOFTA_bp = 7 ; Fault A Software Mode bit position
.equ FAULT_HALTA_gm = 0x60 ; Fault A Halt Action group mask
.equ FAULT_HALTA_gp = 5 ; Fault A Halt Action group position
.equ FAULT_HALTA0_bm = (1<<5) ; Fault A Halt Action bit 0 mask
.equ FAULT_HALTA0_bp = 5 ; Fault A Halt Action bit 0 position
.equ FAULT_HALTA1_bm = (1<<6) ; Fault A Halt Action bit 1 mask
.equ FAULT_HALTA1_bp = 6 ; Fault A Halt Action bit 1 position
.equ FAULT_RESTARTA_bm = 0x10 ; Fault A Restart Action bit mask
.equ FAULT_RESTARTA_bp = 4 ; Fault A Restart Action bit position
.equ FAULT_KEEPA_bm = 0x08 ; Fault A Keep Action bit mask
.equ FAULT_KEEPA_bp = 3 ; Fault A Keep Action bit position
.equ FAULT_SRCA_gm = 0x03 ; Fault A Source Selection group mask
.equ FAULT_SRCA_gp = 0 ; Fault A Source Selection group position
.equ FAULT_SRCA0_bm = (1<<0) ; Fault A Source Selection bit 0 mask
.equ FAULT_SRCA0_bp = 0 ; Fault A Source Selection bit 0 position
.equ FAULT_SRCA1_bm = (1<<1) ; Fault A Source Selection bit 1 mask
.equ FAULT_SRCA1_bp = 1 ; Fault A Source Selection bit 1 position

; FAULT_CTRLC masks
.equ FAULT_CAPTA_bm = 0x20 ; Fault A Capture bit mask
.equ FAULT_CAPTA_bp = 5 ; Fault A Capture bit position
.equ FAULT_FILTERA_bm = 0x04 ; Fault A Digital Filter Selection bit mask
.equ FAULT_FILTERA_bp = 2 ; Fault A Digital Filter Selection bit position
.equ FAULT_BLANKA_bm = 0x02 ; Fault A Blanking bit mask
.equ FAULT_BLANKA_bp = 1 ; Fault A Blanking bit position
.equ FAULT_QUALA_bm = 0x01 ; Fault A Qualification bit mask
.equ FAULT_QUALA_bp = 0 ; Fault A Qualification bit position

; FAULT_CTRLD masks
.equ FAULT_SOFTB_bm = 0x80 ; Fault B Software Mode bit mask
.equ FAULT_SOFTB_bp = 7 ; Fault B Software Mode bit position
.equ FAULT_HALTB_gm = 0x60 ; Fault B Halt Action group mask
.equ FAULT_HALTB_gp = 5 ; Fault B Halt Action group position
.equ FAULT_HALTB0_bm = (1<<5) ; Fault B Halt Action bit 0 mask
.equ FAULT_HALTB0_bp = 5 ; Fault B Halt Action bit 0 position
.equ FAULT_HALTB1_bm = (1<<6) ; Fault B Halt Action bit 1 mask
.equ FAULT_HALTB1_bp = 6 ; Fault B Halt Action bit 1 position
.equ FAULT_RESTARTB_bm = 0x10 ; Fault B Restart Action bit mask
.equ FAULT_RESTARTB_bp = 4 ; Fault B Restart Action bit position
.equ FAULT_KEEPB_bm = 0x08 ; Fault B Keep Action bit mask
.equ FAULT_KEEPB_bp = 3 ; Fault B Keep Action bit position
.equ FAULT_SRCB_gm = 0x03 ; Fault B Source Selection group mask
.equ FAULT_SRCB_gp = 0 ; Fault B Source Selection group position
.equ FAULT_SRCB0_bm = (1<<0) ; Fault B Source Selection bit 0 mask
.equ FAULT_SRCB0_bp = 0 ; Fault B Source Selection bit 0 position
.equ FAULT_SRCB1_bm = (1<<1) ; Fault B Source Selection bit 1 mask
.equ FAULT_SRCB1_bp = 1 ; Fault B Source Selection bit 1 position

; FAULT_CTRLE masks
.equ FAULT_CAPTB_bm = 0x20 ; Fault B Capture bit mask
.equ FAULT_CAPTB_bp = 5 ; Fault B Capture bit position
.equ FAULT_FILTERB_bm = 0x04 ; Fault B Digital Filter Selection bit mask
.equ FAULT_FILTERB_bp = 2 ; Fault B Digital Filter Selection bit position
.equ FAULT_BLANKB_bm = 0x02 ; Fault B Blanking bit mask
.equ FAULT_BLANKB_bp = 1 ; Fault B Blanking bit position
.equ FAULT_QUALB_bm = 0x01 ; Fault B Qualification bit mask
.equ FAULT_QUALB_bp = 0 ; Fault B Qualification bit position

; FAULT_STATUS masks
.equ FAULT_STATEB_bm = 0x80 ; Fault B State bit mask
.equ FAULT_STATEB_bp = 7 ; Fault B State bit position
.equ FAULT_STATEA_bm = 0x40 ; Fault A State bit mask
.equ FAULT_STATEA_bp = 6 ; Fault A State bit position
.equ FAULT_STATEE_bm = 0x20 ; Fault E State bit mask
.equ FAULT_STATEE_bp = 5 ; Fault E State bit position
.equ FAULT_IDX_bm = 0x08 ; Channel Index Flag bit mask
.equ FAULT_IDX_bp = 3 ; Channel Index Flag bit position
.equ FAULT_FAULTBIN_bm = 0x04 ; Fault B Flag bit mask
.equ FAULT_FAULTBIN_bp = 2 ; Fault B Flag bit position
.equ FAULT_FAULTAIN_bm = 0x02 ; Fault A Flag bit mask
.equ FAULT_FAULTAIN_bp = 1 ; Fault A Flag bit position
.equ FAULT_FAULTEIN_bm = 0x01 ; Fault E Flag bit mask
.equ FAULT_FAULTEIN_bp = 0 ; Fault E Flag bit position

; FAULT_CTRLGCLR masks
.equ FAULT_HALTBCLR_bm = 0x80 ; State B Clear bit mask
.equ FAULT_HALTBCLR_bp = 7 ; State B Clear bit position
.equ FAULT_HALTACLR_bm = 0x40 ; State A Clear bit mask
.equ FAULT_HALTACLR_bp = 6 ; State A Clear bit position
.equ FAULT_STATEECLR_bm = 0x20 ; State E Clear bit mask
.equ FAULT_STATEECLR_bp = 5 ; State E Clear bit position
.equ FAULT_FAULTB_bm = 0x04 ; Fault B Flag bit mask
.equ FAULT_FAULTB_bp = 2 ; Fault B Flag bit position
.equ FAULT_FAULTA_bm = 0x02 ; Fault A Flag bit mask
.equ FAULT_FAULTA_bp = 1 ; Fault A Flag bit position
.equ FAULT_FAULTE_bm = 0x01 ; Fault E Flag bit mask
.equ FAULT_FAULTE_bp = 0 ; Fault E Flag bit position

; FAULT_CTRLGSET masks
.equ FAULT_FAULTBSW_bm = 0x80 ; Software Fault B bit mask
.equ FAULT_FAULTBSW_bp = 7 ; Software Fault B bit position
.equ FAULT_FAULTASW_bm = 0x40 ; Software Fault A bit mask
.equ FAULT_FAULTASW_bp = 6 ; Software Fault A bit position
.equ FAULT_FAULTESW_bm = 0x20 ; Software Fault E bit mask
.equ FAULT_FAULTESW_bp = 5 ; Software Fault E bit position
.equ FAULT_IDXCMD_gm = 0x18 ; Channel index Command group mask
.equ FAULT_IDXCMD_gp = 3 ; Channel index Command group position
.equ FAULT_IDXCMD0_bm = (1<<3) ; Channel index Command bit 0 mask
.equ FAULT_IDXCMD0_bp = 3 ; Channel index Command bit 0 position
.equ FAULT_IDXCMD1_bm = (1<<4) ; Channel index Command bit 1 mask
.equ FAULT_IDXCMD1_bp = 4 ; Channel index Command bit 1 position

; Ramp Mode Selection
.equ FAULT_RAMP_RAMP1_gc = (0x00<<6) ; Normal Mode
.equ FAULT_RAMP_RAMP2_gc = (0x02<<6) ; RAMP2 Mode

; Fault E Input Source Selection
.equ FAULT_SRCE_DISABLE_gc = (0x00<<0) ; Fault Protection Disabled
.equ FAULT_SRCE_CHN_gc = (0x01<<0) ; Event Channel n
.equ FAULT_SRCE_CHN1_gc = (0x02<<0) ; Event Channel n+1
.equ FAULT_SRCE_CHN2_gc = (0x03<<0) ; Event Channel n+2

; Fault A Halt Action Selection
.equ FAULT_HALTA_DISABLE_gc = (0x00<<5) ; Halt Action Disabled
.equ FAULT_HALTA_HW_gc = (0x01<<5) ; Hardware Halt Action
.equ FAULT_HALTA_SW_gc = (0x02<<5) ; Software Halt Action

; Fault A Source Selection
.equ FAULT_SRCA_DISABLE_gc = (0x00<<0) ; Fault A Disabled
.equ FAULT_SRCA_CHN_gc = (0x01<<0) ; Event Channel n
.equ FAULT_SRCA_CHN1_gc = (0x02<<0) ; Event Channel n+1
.equ FAULT_SRCA_LINK_gc = (0x03<<0) ; Fault A linked to Fault B State from previous cycle

