trol73/avr-make/asm/include/ATxmega16E5def.inc
; Character Size
.equ USART_CHSIZE_5BIT_gc = (0x00<<0) ; Character size: 5 bit
.equ USART_CHSIZE_6BIT_gc = (0x01<<0) ; Character size: 6 bit
.equ USART_CHSIZE_7BIT_gc = (0x02<<0) ; Character size: 7 bit
.equ USART_CHSIZE_8BIT_gc = (0x03<<0) ; Character size: 8 bit
.equ USART_CHSIZE_9BIT_gc = (0x07<<0) ; Character size: 9 bit

; Communication Mode
.equ USART_CMODE_ASYNCHRONOUS_gc = (0x00<<6) ; Asynchronous Mode
.equ USART_CMODE_SYNCHRONOUS_gc = (0x01<<6) ; Synchronous Mode
.equ USART_CMODE_IRDA_gc = (0x02<<6) ; IrDA Mode
.equ USART_CMODE_MSPI_gc = (0x03<<6) ; Master SPI Mode

; Parity Mode
.equ USART_PMODE_DISABLED_gc = (0x00<<4) ; No Parity
.equ USART_PMODE_EVEN_gc = (0x02<<4) ; Even Parity
.equ USART_PMODE_ODD_gc = (0x03<<4) ; Odd Parity

; Encoding and Decoding Type
.equ USART_DECTYPE_DATA_gc = (0x00<<4) ; DATA Field Encoding
.equ USART_DECTYPE_SDATA_gc = (0x02<<4) ; Start and Data Fields Encoding
.equ USART_DECTYPE_NOTSDATA_gc = (0x03<<4) ; Start and Data Fields Encoding, with invertion in START field

; XCL LUT Action
.equ USART_LUTACT_OFF_gc = (0x00<<2) ; Standard Frame Configuration
.equ USART_LUTACT_RX_gc = (0x01<<2) ; Receiver Decoding Enabled
.equ USART_LUTACT_TX_gc = (0x02<<2) ; Transmitter Encoding Enabled
.equ USART_LUTACT_BOTH_gc = (0x03<<2) ; Both Encoding and Decoding Enabled

; XCL Peripheral Counter Action
.equ USART_PECACT_OFF_gc = (0x00<<0) ; Standard Mode
.equ USART_PECACT_PEC0_gc = (0x01<<0) ; Variable Data Lenght in Reception
.equ USART_PECACT_PEC1_gc = (0x02<<0) ; Variable Data Lenght in Transmission
.equ USART_PECACT_PERC01_gc = (0x03<<0) ; Variable Data Lenght in both Reception and Transmission


;*************************************************************************
;** SPI - Serial Peripheral Interface
;*************************************************************************

; SPI_CTRL masks
.equ SPI_CLK2X_bm = 0x80 ; Enable Double Speed bit mask
.equ SPI_CLK2X_bp = 7 ; Enable Double Speed bit position
.equ SPI_ENABLE_bm = 0x40 ; Enable SPI Module bit mask
.equ SPI_ENABLE_bp = 6 ; Enable SPI Module bit position
.equ SPI_DORD_bm = 0x20 ; Data Order Setting bit mask
.equ SPI_DORD_bp = 5 ; Data Order Setting bit position
.equ SPI_MASTER_bm = 0x10 ; Master Operation Enable bit mask
.equ SPI_MASTER_bp = 4 ; Master Operation Enable bit position
.equ SPI_MODE_gm = 0x0C ; SPI Mode group mask
.equ SPI_MODE_gp = 2 ; SPI Mode group position
.equ SPI_MODE0_bm = (1<<2) ; SPI Mode bit 0 mask
.equ SPI_MODE0_bp = 2 ; SPI Mode bit 0 position
.equ SPI_MODE1_bm = (1<<3) ; SPI Mode bit 1 mask
.equ SPI_MODE1_bp = 3 ; SPI Mode bit 1 position
.equ SPI_PRESCALER_gm = 0x03 ; Prescaler group mask
.equ SPI_PRESCALER_gp = 0 ; Prescaler group position
.equ SPI_PRESCALER0_bm = (1<<0) ; Prescaler bit 0 mask
.equ SPI_PRESCALER0_bp = 0 ; Prescaler bit 0 position
.equ SPI_PRESCALER1_bm = (1<<1) ; Prescaler bit 1 mask
.equ SPI_PRESCALER1_bp = 1 ; Prescaler bit 1 position

; SPI_INTCTRL masks
.equ SPI_RXCIE_bm = 0x80 ; Receive Complete Interrupt Enable (In Buffer Modes Only). bit mask
.equ SPI_RXCIE_bp = 7 ; Receive Complete Interrupt Enable (In Buffer Modes Only). bit position
.equ SPI_TXCIE_bm = 0x40 ; Transmit Complete Interrupt Enable (In Buffer Modes Only). bit mask
.equ SPI_TXCIE_bp = 6 ; Transmit Complete Interrupt Enable (In Buffer Modes Only). bit position
.equ SPI_DREIE_bm = 0x20 ; Data Register Empty Interrupt Enable (In Buffer Modes Only). bit mask
.equ SPI_DREIE_bp = 5 ; Data Register Empty Interrupt Enable (In Buffer Modes Only). bit position
.equ SPI_SSIE_bm = 0x10 ; Slave Select Trigger Interrupt Enable (In Buffer Modes Only). bit mask
.equ SPI_SSIE_bp = 4 ; Slave Select Trigger Interrupt Enable (In Buffer Modes Only). bit position
.equ SPI_INTLVL_gm = 0x03 ; Interrupt level group mask
.equ SPI_INTLVL_gp = 0 ; Interrupt level group position
.equ SPI_INTLVL0_bm = (1<<0) ; Interrupt level bit 0 mask
.equ SPI_INTLVL0_bp = 0 ; Interrupt level bit 0 position
.equ SPI_INTLVL1_bm = (1<<1) ; Interrupt level bit 1 mask
.equ SPI_INTLVL1_bp = 1 ; Interrupt level bit 1 position

; SPI_STATUS masks
.equ SPI_IF_bm = 0x80 ; Interrupt Flag (In Standard Mode Only). bit mask
.equ SPI_IF_bp = 7 ; Interrupt Flag (In Standard Mode Only). bit position
.equ SPI_RXCIF_bm = 0x80 ; Receive Complete Interrupt Flag (In Buffer Modes Only). bit mask
.equ SPI_RXCIF_bp = 7 ; Receive Complete Interrupt Flag (In Buffer Modes Only). bit position
.equ SPI_WRCOL_bm = 0x40 ; Write Collision Flag (In Standard Mode Only). bit mask
.equ SPI_WRCOL_bp = 6 ; Write Collision Flag (In Standard Mode Only). bit position
.equ SPI_TXCIF_bm = 0x40 ; Transmit Complete Interrupt Flag (In Buffer Modes Only). bit mask
.equ SPI_TXCIF_bp = 6 ; Transmit Complete Interrupt Flag (In Buffer Modes Only). bit position
.equ SPI_DREIF_bm = 0x20 ; Data Register Empty Interrupt Flag (In Buffer Modes Only). bit mask
.equ SPI_DREIF_bp = 5 ; Data Register Empty Interrupt Flag (In Buffer Modes Only). bit position
.equ SPI_SSIF_bm = 0x10 ; Slave Select Trigger Interrupt Flag (In Buffer Modes Only). bit mask
.equ SPI_SSIF_bp = 4 ; Slave Select Trigger Interrupt Flag (In Buffer Modes Only). bit position
.equ SPI_BUFOVF_bm = 0x01 ; Buffer Overflow (In Buffer Modes Only). bit mask
.equ SPI_BUFOVF_bp = 0 ; Buffer Overflow (In Buffer Modes Only). bit position

; SPI_CTRLB masks
.equ SPI_BUFMODE_gm = 0xC0 ; Buffer Modes group mask
.equ SPI_BUFMODE_gp = 6 ; Buffer Modes group position
.equ SPI_BUFMODE0_bm = (1<<6) ; Buffer Modes bit 0 mask
.equ SPI_BUFMODE0_bp = 6 ; Buffer Modes bit 0 position
.equ SPI_BUFMODE1_bm = (1<<7) ; Buffer Modes bit 1 mask
.equ SPI_BUFMODE1_bp = 7 ; Buffer Modes bit 1 position
.equ SPI_SSD_bm = 0x04 ; Slave Select Disable bit mask
.equ SPI_SSD_bp = 2 ; Slave Select Disable bit position

; SPI Mode
.equ SPI_MODE_0_gc = (0x00<<2) ; SPI Mode 0, base clock at "0", sampling on leading edge (rising) & set-up on trailling edge (falling).
.equ SPI_MODE_1_gc = (0x01<<2) ; SPI Mode 1, base clock at "0", set-up on leading edge (rising) & sampling on trailling edge (falling).
.equ SPI_MODE_2_gc = (0x02<<2) ; SPI Mode 2, base clock at "1", sampling on leading edge (falling) & set-up on trailling edge (rising).
.equ SPI_MODE_3_gc = (0x03<<2) ; SPI Mode 3, base clock at "1", set-up on leading edge (falling) & sampling on trailling edge (rising).

; Prescaler setting
.equ SPI_PRESCALER_DIV4_gc = (0x00<<0) ; If CLK2X=1 CLKper/2, else (CLK2X=0) CLKper/4.
.equ SPI_PRESCALER_DIV16_gc = (0x01<<0) ; If CLK2X=1 CLKper/8, else (CLK2X=0) CLKper/16.
.equ SPI_PRESCALER_DIV64_gc = (0x02<<0) ; If CLK2X=1 CLKper/32, else (CLK2X=0) CLKper/64.
.equ SPI_PRESCALER_DIV128_gc = (0x03<<0) ; If CLK2X=1 CLKper/64, else (CLK2X=0) CLKper/128.

; Interrupt level
.equ SPI_INTLVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ SPI_INTLVL_LO_gc = (0x01<<0) ; Low Level
.equ SPI_INTLVL_MED_gc = (0x02<<0) ; Medium Level
.equ SPI_INTLVL_HI_gc = (0x03<<0) ; High Level

; Buffer Modes
.equ SPI_BUFMODE_OFF_gc = (0x00<<6) ; SPI Unbuffered Mode
.equ SPI_BUFMODE_BUFMODE1_gc = (0x02<<6) ; Buffer Mode 1 (with dummy byte)
.equ SPI_BUFMODE_BUFMODE2_gc = (0x03<<6) ; Buffer Mode 2 (no dummy byte)


;*************************************************************************
;** IRCOM - IR Communication Module
;*************************************************************************

; IRCOM_CTRL masks
.equ IRCOM_EVSEL_gm = 0x0F ; Event Channel Select group mask
.equ IRCOM_EVSEL_gp = 0 ; Event Channel Select group position
.equ IRCOM_EVSEL0_bm = (1<<0) ; Event Channel Select bit 0 mask
.equ IRCOM_EVSEL0_bp = 0 ; Event Channel Select bit 0 position
.equ IRCOM_EVSEL1_bm = (1<<1) ; Event Channel Select bit 1 mask
.equ IRCOM_EVSEL1_bp = 1 ; Event Channel Select bit 1 position
.equ IRCOM_EVSEL2_bm = (1<<2) ; Event Channel Select bit 2 mask
.equ IRCOM_EVSEL2_bp = 2 ; Event Channel Select bit 2 position
.equ IRCOM_EVSEL3_bm = (1<<3) ; Event Channel Select bit 3 mask
.equ IRCOM_EVSEL3_bp = 3 ; Event Channel Select bit 3 position

; Event channel selection
.equ IRDA_EVSEL_OFF_gc = (0x00<<0) ; No Event Source
.equ IRDA_EVSEL_0_gc = (0x08<<0) ; Event Channel 0
.equ IRDA_EVSEL_1_gc = (0x09<<0) ; Event Channel 1
.equ IRDA_EVSEL_2_gc = (0x0A<<0) ; Event Channel 2
.equ IRDA_EVSEL_3_gc = (0x0B<<0) ; Event Channel 3
.equ IRDA_EVSEL_4_gc = (0x0C<<0) ; Event Channel 4
.equ IRDA_EVSEL_5_gc = (0x0D<<0) ; Event Channel 5
.equ IRDA_EVSEL_6_gc = (0x0E<<0) ; Event Channel 6
.equ IRDA_EVSEL_7_gc = (0x0F<<0) ; Event Channel 7


;*************************************************************************
;** FUSE - Fuses and Lockbits
;*************************************************************************

; NVM_LOCKBITS_LOCKBITS masks
.equ NVM_LOCKBITS_BLBB_gm = 0xC0 ; Boot Lock Bits - Boot Section group mask
.equ NVM_LOCKBITS_BLBB_gp = 6 ; Boot Lock Bits - Boot Section group position
.equ NVM_LOCKBITS_BLBB0_bm = (1<<6) ; Boot Lock Bits - Boot Section bit 0 mask
.equ NVM_LOCKBITS_BLBB0_bp = 6 ; Boot Lock Bits - Boot Section bit 0 position
.equ NVM_LOCKBITS_BLBB1_bm = (1<<7) ; Boot Lock Bits - Boot Section bit 1 mask
.equ NVM_LOCKBITS_BLBB1_bp = 7 ; Boot Lock Bits - Boot Section bit 1 position
.equ NVM_LOCKBITS_BLBA_gm = 0x30 ; Boot Lock Bits - Application Section group mask
.equ NVM_LOCKBITS_BLBA_gp = 4 ; Boot Lock Bits - Application Section group position
.equ NVM_LOCKBITS_BLBA0_bm = (1<<4) ; Boot Lock Bits - Application Section bit 0 mask
.equ NVM_LOCKBITS_BLBA0_bp = 4 ; Boot Lock Bits - Application Section bit 0 position
.equ NVM_LOCKBITS_BLBA1_bm = (1<<5) ; Boot Lock Bits - Application Section bit 1 mask
.equ NVM_LOCKBITS_BLBA1_bp = 5 ; Boot Lock Bits - Application Section bit 1 position
.equ NVM_LOCKBITS_BLBAT_gm = 0x0C ; Boot Lock Bits - Application Table group mask
.equ NVM_LOCKBITS_BLBAT_gp = 2 ; Boot Lock Bits - Application Table group position
.equ NVM_LOCKBITS_BLBAT0_bm = (1<<2) ; Boot Lock Bits - Application Table bit 0 mask
.equ NVM_LOCKBITS_BLBAT0_bp = 2 ; Boot Lock Bits - Application Table bit 0 position
.equ NVM_LOCKBITS_BLBAT1_bm = (1<<3) ; Boot Lock Bits - Application Table bit 1 mask
.equ NVM_LOCKBITS_BLBAT1_bp = 3 ; Boot Lock Bits - Application Table bit 1 position
.equ NVM_LOCKBITS_LB_gm = 0x03 ; Lock Bits group mask
.equ NVM_LOCKBITS_LB_gp = 0 ; Lock Bits group position
.equ NVM_LOCKBITS_LB0_bm = (1<<0) ; Lock Bits bit 0 mask
.equ NVM_LOCKBITS_LB0_bp = 0 ; Lock Bits bit 0 position
.equ NVM_LOCKBITS_LB1_bm = (1<<1) ; Lock Bits bit 1 mask
.equ NVM_LOCKBITS_LB1_bp = 1 ; Lock Bits bit 1 position

; NVM_FUSES_FUSEBYTE1 masks
.equ NVM_FUSES_WDWP_gm = 0xF0 ; Watchdog Window Timeout Period group mask
.equ NVM_FUSES_WDWP_gp = 4 ; Watchdog Window Timeout Period group position
.equ NVM_FUSES_WDWP0_bm = (1<<4) ; Watchdog Window Timeout Period bit 0 mask
.equ NVM_FUSES_WDWP0_bp = 4 ; Watchdog Window Timeout Period bit 0 position
.equ NVM_FUSES_WDWP1_bm = (1<<5) ; Watchdog Window Timeout Period bit 1 mask
.equ NVM_FUSES_WDWP1_bp = 5 ; Watchdog Window Timeout Period bit 1 position
.equ NVM_FUSES_WDWP2_bm = (1<<6) ; Watchdog Window Timeout Period bit 2 mask
.equ NVM_FUSES_WDWP2_bp = 6 ; Watchdog Window Timeout Period bit 2 position
.equ NVM_FUSES_WDWP3_bm = (1<<7) ; Watchdog Window Timeout Period bit 3 mask
.equ NVM_FUSES_WDWP3_bp = 7 ; Watchdog Window Timeout Period bit 3 position
.equ NVM_FUSES_WDP_gm = 0x0F ; Watchdog Timeout Period group mask
.equ NVM_FUSES_WDP_gp = 0 ; Watchdog Timeout Period group position
.equ NVM_FUSES_WDP0_bm = (1<<0) ; Watchdog Timeout Period bit 0 mask
.equ NVM_FUSES_WDP0_bp = 0 ; Watchdog Timeout Period bit 0 position
.equ NVM_FUSES_WDP1_bm = (1<<1) ; Watchdog Timeout Period bit 1 mask
.equ NVM_FUSES_WDP1_bp = 1 ; Watchdog Timeout Period bit 1 position
.equ NVM_FUSES_WDP2_bm = (1<<2) ; Watchdog Timeout Period bit 2 mask
.equ NVM_FUSES_WDP2_bp = 2 ; Watchdog Timeout Period bit 2 position
.equ NVM_FUSES_WDP3_bm = (1<<3) ; Watchdog Timeout Period bit 3 mask
.equ NVM_FUSES_WDP3_bp = 3 ; Watchdog Timeout Period bit 3 position

