trol73/avr-make/asm/include/ATxmega16E5def.inc
#define APPTABLE_SECTION_START 0x3000
#define APPTABLE_SECTION_SIZE 0x1000
#define APPTABLE_SECTION_END (0x3000 + 0x1000 - 1)

#define BOOT_SECTION_START 0x4000
#define BOOT_SECTION_SIZE 0x1000
#define BOOT_SECTION_END (0x4000 + 0x1000 - 1)

#define DATAMEM_START 0x0000
#define DATAMEM_SIZE 0x2800
#define DATAMEM_END (0x0000 + 0x2800 - 1)

#define IO_START 0x0000
#define IO_SIZE 0x1000
#define IO_END (0x0000 + 0x1000 - 1)

#define MAPPED_EEPROM_START 0x1000
#define MAPPED_EEPROM_SIZE 0x0200
#define MAPPED_EEPROM_END (0x1000 + 0x0200 - 1)

#define INTERNAL_SRAM_START 0x2000
#define INTERNAL_SRAM_SIZE 0x0800
#define INTERNAL_SRAM_END (0x2000 + 0x0800 - 1)

#define EEPROM_START 0x0000
#define EEPROM_SIZE 0x0200
#define EEPROM_END (0x0000 + 0x0200 - 1)

#define SIGNATURES_START 0x0000
#define SIGNATURES_SIZE 0x0003
#define SIGNATURES_END (0x0000 + 0x0003 - 1)

#define FUSES_START 0x0000
#define FUSES_SIZE 0x0006
#define FUSES_END (0x0000 + 0x0006 - 1)

#define LOCKBITS_START 0x0000
#define LOCKBITS_SIZE 0x0001
#define LOCKBITS_END (0x0000 + 0x0001 - 1)

#define USER_SIGNATURES_START 0x0000
#define USER_SIGNATURES_SIZE 0x0080
#define USER_SIGNATURES_END (0x0000 + 0x0080 - 1)

#define PROD_SIGNATURES_START 0x0000
#define PROD_SIGNATURES_SIZE 0x0034
#define PROD_SIGNATURES_END (0x0000 + 0x0034 - 1)


; Legacy definitions
.equ	FLASHSTART	= (PROGMEM_START / 2) ; Note: Word address
.equ	FLASHEND	= (PROGMEM_END / 2) ; Note: Word address
.equ	IOEND		= IO_END
.equ	SRAM_START	= INTERNAL_SRAM_START
.equ	SRAM_SIZE	= INTERNAL_SRAM_SIZE
.equ	RAMEND		= INTERNAL_SRAM_END
.equ	E2END		= EEPROM_END
.equ	EEPROMEND	= EEPROM_END


; Definitions used by the assembler
#pragma AVRPART MEMORY PROG_FLASH 0x5000
#pragma AVRPART MEMORY EEPROM 0x0200
#pragma AVRPART MEMORY INT_SRAM SIZE 0x0800
#pragma AVRPART MEMORY INT_SRAM START_ADDR 0x2000

; ***** INTERRUPT VECTORS, ABSOLUTE ADDRESSES ****************************

; OSC interrupt vectors
.equ OSC_OSCF_vect = 2 ; Oscillator Failure Interrupt (NMI)

; PORTR interrupt vectors
.equ PORTR_INT_vect = 4 ; External Interrupt

; EDMA interrupt vectors
.equ EDMA_CH0_vect = 6 ; EDMA Channel 0 Interrupt
.equ EDMA_CH1_vect = 8 ; EDMA Channel 1 Interrupt
.equ EDMA_CH2_vect = 10 ; EDMA Channel 2 Interrupt
.equ EDMA_CH3_vect = 12 ; EDMA Channel 3 Interrupt

; RTC interrupt vectors
.equ RTC_OVF_vect = 14 ; Overflow Interrupt
.equ RTC_COMP_vect = 16 ; Compare Interrupt

; PORTC interrupt vectors
.equ PORTC_INT_vect = 18 ; External Interrupt

; TWIC interrupt vectors
.equ TWIC_TWIS_vect = 20 ; TWI Slave Interrupt
.equ TWIC_TWIM_vect = 22 ; TWI Master Interrupt

; TCC4 interrupt vectors
.equ TCC4_OVF_vect = 24 ; Overflow Interrupt
.equ TCC4_ERR_vect = 26 ; Error Interrupt
.equ TCC4_CCA_vect = 28 ; Channel A Compare or Capture Interrupt
.equ TCC4_CCB_vect = 30 ; Channel B Compare or Capture Interrupt
.equ TCC4_CCC_vect = 32 ; Channel C Compare or Capture Interrupt
.equ TCC4_CCD_vect = 34 ; Channel D Compare or Capture Interrupt

; TCC5 interrupt vectors
.equ TCC5_OVF_vect = 36 ; Overflow Interrupt
.equ TCC5_ERR_vect = 38 ; Error Interrupt
.equ TCC5_CCA_vect = 40 ; Channel A Compare or Capture Interrupt
.equ TCC5_CCB_vect = 42 ; Channel B Compare or Capture Interrupt

; SPIC interrupt vectors
.equ SPIC_INT_vect = 44 ; SPI Interrupt

; USARTC0 interrupt vectors
.equ USARTC0_RXC_vect = 46 ; Reception Complete Interrupt
.equ USARTC0_DRE_vect = 48 ; Data Register Empty Interrupt
.equ USARTC0_TXC_vect = 50 ; Transmission Complete Interrupt

; NVM interrupt vectors
.equ NVM_EE_vect = 52 ; EE Interrupt
.equ NVM_SPM_vect = 54 ; SPM Interrupt

; XCL interrupt vectors
.equ XCL_UNF_vect = 56 ; Timer/Counter Underflow Interrupt
.equ XCL_CC_vect = 58 ; Timer/Counter Compare or Capture Interrupt

; PORTA interrupt vectors
.equ PORTA_INT_vect = 60 ; External Interrupt

; ACA interrupt vectors
.equ ACA_AC0_vect = 62 ; AC0 Interrupt
.equ ACA_AC1_vect = 64 ; AC1 Interrupt
.equ ACA_ACW_vect = 66 ; ACW Window Mode Interrupt

; ADCA interrupt vectors
.equ ADCA_CH0_vect = 68 ; ADC Channel Interrupt

; PORTD interrupt vectors
.equ PORTD_INT_vect = 70 ; External Interrupt

; TCD5 interrupt vectors
.equ TCD5_OVF_vect = 72 ; Overflow Interrupt
.equ TCD5_ERR_vect = 74 ; Error Interrupt
.equ TCD5_CCA_vect = 76 ; Channel A Compare or Capture Interrupt
.equ TCD5_CCB_vect = 78 ; Channel B Compare or Capture Interrupt

; USARTD0 interrupt vectors
.equ USARTD0_RXC_vect = 80 ; Reception Complete Interrupt
.equ USARTD0_DRE_vect = 82 ; Data Register Empty Interrupt
.equ USARTD0_TXC_vect = 84 ; Transmission Complete Interrupt



; ***** INTERRUPT VECTORS, MODULE BASES **********************************

.equ OSC_vbase = 2
.equ PORTR_vbase = 4
.equ EDMA_vbase = 6
.equ RTC_vbase = 14
.equ PORTC_vbase = 18
.equ TWIC_vbase = 20
.equ TCC4_vbase = 24
.equ TCC5_vbase = 36
.equ SPIC_vbase = 44
.equ USARTC0_vbase = 46
.equ NVM_vbase = 52
.equ XCL_vbase = 56
.equ PORTA_vbase = 60
.equ ACA_vbase = 62
.equ ADCA_vbase = 68
.equ PORTD_vbase = 70
.equ TCD5_vbase = 72
.equ USARTD0_vbase = 80


; ***** INTERRUPT VECTORS, VECTOR OFFSETS ********************************

; OSC interrupt vector offsets

.equ OSC_OSCF_voffset = 0

; PORTR interrupt vector offsets

.equ PORTR_INT_voffset = 0

; EDMA interrupt vector offsets

.equ EDMA_CH0_voffset = 0
.equ EDMA_CH1_voffset = 2
.equ EDMA_CH2_voffset = 4
.equ EDMA_CH3_voffset = 6

; RTC interrupt vector offsets

.equ RTC_OVF_voffset = 0
.equ RTC_COMP_voffset = 2

; PORTC interrupt vector offsets

.equ PORTC_INT_voffset = 0

; TWIC interrupt vector offsets

.equ TWIC_TWIS_voffset = 0
.equ TWIC_TWIM_voffset = 2

; TCC4 interrupt vector offsets

.equ TCC4_OVF_voffset = 0
.equ TCC4_ERR_voffset = 2
.equ TCC4_CCA_voffset = 4
.equ TCC4_CCB_voffset = 6
.equ TCC4_CCC_voffset = 8
.equ TCC4_CCD_voffset = 10

; TCC5 interrupt vector offsets

.equ TCC5_OVF_voffset = 0
.equ TCC5_ERR_voffset = 2
.equ TCC5_CCA_voffset = 4
.equ TCC5_CCB_voffset = 6

; SPIC interrupt vector offsets

.equ SPIC_INT_voffset = 0

; USARTC0 interrupt vector offsets

.equ USARTC0_RXC_voffset = 0
.equ USARTC0_DRE_voffset = 2
.equ USARTC0_TXC_voffset = 4

; NVM interrupt vector offsets

.equ NVM_EE_voffset = 0
.equ NVM_SPM_voffset = 2

; XCL interrupt vector offsets

.equ XCL_UNF_voffset = 0
.equ XCL_CC_voffset = 2

; PORTA interrupt vector offsets

.equ PORTA_INT_voffset = 0

; ACA interrupt vector offsets

.equ ACA_AC0_voffset = 0
.equ ACA_AC1_voffset = 2
.equ ACA_ACW_voffset = 4

; ADCA interrupt vector offsets

.equ ADCA_CH0_voffset = 0

; PORTD interrupt vector offsets

.equ PORTD_INT_voffset = 0

; TCD5 interrupt vector offsets

.equ TCD5_OVF_voffset = 0
.equ TCD5_ERR_voffset = 2
.equ TCD5_CCA_voffset = 4
.equ TCD5_CCB_voffset = 6

; USARTD0 interrupt vector offsets

.equ USARTD0_RXC_voffset = 0
.equ USARTD0_DRE_voffset = 2
.equ USARTD0_TXC_voffset = 4



.equ INT_VECTORS_SIZE = 86 ; size in words


#endif /* _ATXMEGA16E5DEF_INC_ */

; ***** END OF FILE ******************************************************



